SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/ZGM23/Include/zgm23_rac.h
/* Bit fields for RAC ANTDIV */
#define _RAC_ANTDIV_RESETVALUE                                        0x00000000UL                                       /**< Default value for RAC_ANTDIV                */
#define _RAC_ANTDIV_MASK                                              0x00000FFFUL                                       /**< Mask for RAC_ANTDIV                         */
#define RAC_ANTDIV_INTDIVLNAMIXEN0                                    (0x1UL << 0)                                       /**< INTDIVLNAMIXEN0                             */
#define _RAC_ANTDIV_INTDIVLNAMIXEN0_SHIFT                             0                                                  /**< Shift value for RAC_INTDIVLNAMIXEN0         */
#define _RAC_ANTDIV_INTDIVLNAMIXEN0_MASK                              0x1UL                                              /**< Bit mask for RAC_INTDIVLNAMIXEN0            */
#define _RAC_ANTDIV_INTDIVLNAMIXEN0_DEFAULT                           0x00000000UL                                       /**< Mode DEFAULT for RAC_ANTDIV                 */
#define RAC_ANTDIV_INTDIVLNAMIXEN0_DEFAULT                            (_RAC_ANTDIV_INTDIVLNAMIXEN0_DEFAULT << 0)         /**< Shifted mode DEFAULT for RAC_ANTDIV         */
#define RAC_ANTDIV_INTDIVLNAMIXENAMP0                                 (0x1UL << 1)                                       /**< INTDIVLNAMIXENAMP0                          */
#define _RAC_ANTDIV_INTDIVLNAMIXENAMP0_SHIFT                          1                                                  /**< Shift value for RAC_INTDIVLNAMIXENAMP0      */
#define _RAC_ANTDIV_INTDIVLNAMIXENAMP0_MASK                           0x2UL                                              /**< Bit mask for RAC_INTDIVLNAMIXENAMP0         */
#define _RAC_ANTDIV_INTDIVLNAMIXENAMP0_DEFAULT                        0x00000000UL                                       /**< Mode DEFAULT for RAC_ANTDIV                 */
#define RAC_ANTDIV_INTDIVLNAMIXENAMP0_DEFAULT                         (_RAC_ANTDIV_INTDIVLNAMIXENAMP0_DEFAULT << 1)      /**< Shifted mode DEFAULT for RAC_ANTDIV         */
#define RAC_ANTDIV_INTDIVLNAMIXRFATTDCEN0                             (0x1UL << 2)                                       /**< INTDIVLNAMIXRFATTDCEN0                      */
#define _RAC_ANTDIV_INTDIVLNAMIXRFATTDCEN0_SHIFT                      2                                                  /**< Shift value for RAC_INTDIVLNAMIXRFATTDCEN0  */
#define _RAC_ANTDIV_INTDIVLNAMIXRFATTDCEN0_MASK                       0x4UL                                              /**< Bit mask for RAC_INTDIVLNAMIXRFATTDCEN0     */
#define _RAC_ANTDIV_INTDIVLNAMIXRFATTDCEN0_DEFAULT                    0x00000000UL                                       /**< Mode DEFAULT for RAC_ANTDIV                 */
#define RAC_ANTDIV_INTDIVLNAMIXRFATTDCEN0_DEFAULT                     (_RAC_ANTDIV_INTDIVLNAMIXRFATTDCEN0_DEFAULT << 2)  /**< Shifted mode DEFAULT for RAC_ANTDIV         */
#define RAC_ANTDIV_INTDIVLNAMIXRFPKDENRF0                             (0x1UL << 3)                                       /**< INTDIVLNAMIXRFPKDENRF0                      */
#define _RAC_ANTDIV_INTDIVLNAMIXRFPKDENRF0_SHIFT                      3                                                  /**< Shift value for RAC_INTDIVLNAMIXRFPKDENRF0  */
#define _RAC_ANTDIV_INTDIVLNAMIXRFPKDENRF0_MASK                       0x8UL                                              /**< Bit mask for RAC_INTDIVLNAMIXRFPKDENRF0     */
#define _RAC_ANTDIV_INTDIVLNAMIXRFPKDENRF0_DEFAULT                    0x00000000UL                                       /**< Mode DEFAULT for RAC_ANTDIV                 */
#define RAC_ANTDIV_INTDIVLNAMIXRFPKDENRF0_DEFAULT                     (_RAC_ANTDIV_INTDIVLNAMIXRFPKDENRF0_DEFAULT << 3)  /**< Shifted mode DEFAULT for RAC_ANTDIV         */
#define RAC_ANTDIV_INTDIVSYLODIVRLO0SUBGEN                            (0x1UL << 4)                                       /**< INTDIVSYLODIVRLO0SUBGEN                     */
#define _RAC_ANTDIV_INTDIVSYLODIVRLO0SUBGEN_SHIFT                     4                                                  /**< Shift value for RAC_INTDIVSYLODIVRLO0SUBGEN */
#define _RAC_ANTDIV_INTDIVSYLODIVRLO0SUBGEN_MASK                      0x10UL                                             /**< Bit mask for RAC_INTDIVSYLODIVRLO0SUBGEN    */
#define _RAC_ANTDIV_INTDIVSYLODIVRLO0SUBGEN_DEFAULT                   0x00000000UL                                       /**< Mode DEFAULT for RAC_ANTDIV                 */
#define RAC_ANTDIV_INTDIVSYLODIVRLO0SUBGEN_DEFAULT                    (_RAC_ANTDIV_INTDIVSYLODIVRLO0SUBGEN_DEFAULT << 4) /**< Shifted mode DEFAULT for RAC_ANTDIV         */
#define RAC_ANTDIV_INTDIVLNAMIXEN1                                    (0x1UL << 5)                                       /**< INTDIVLNAMIXEN1                             */
#define _RAC_ANTDIV_INTDIVLNAMIXEN1_SHIFT                             5                                                  /**< Shift value for RAC_INTDIVLNAMIXEN1         */
#define _RAC_ANTDIV_INTDIVLNAMIXEN1_MASK                              0x20UL                                             /**< Bit mask for RAC_INTDIVLNAMIXEN1            */
#define _RAC_ANTDIV_INTDIVLNAMIXEN1_DEFAULT                           0x00000000UL                                       /**< Mode DEFAULT for RAC_ANTDIV                 */
#define RAC_ANTDIV_INTDIVLNAMIXEN1_DEFAULT                            (_RAC_ANTDIV_INTDIVLNAMIXEN1_DEFAULT << 5)         /**< Shifted mode DEFAULT for RAC_ANTDIV         */
#define RAC_ANTDIV_INTDIVLNAMIXENAMP1                                 (0x1UL << 6)                                       /**< INTDIVLNAMIXENAMP1                          */
#define _RAC_ANTDIV_INTDIVLNAMIXENAMP1_SHIFT                          6                                                  /**< Shift value for RAC_INTDIVLNAMIXENAMP1      */
#define _RAC_ANTDIV_INTDIVLNAMIXENAMP1_MASK                           0x40UL                                             /**< Bit mask for RAC_INTDIVLNAMIXENAMP1         */
#define _RAC_ANTDIV_INTDIVLNAMIXENAMP1_DEFAULT                        0x00000000UL                                       /**< Mode DEFAULT for RAC_ANTDIV                 */
#define RAC_ANTDIV_INTDIVLNAMIXENAMP1_DEFAULT                         (_RAC_ANTDIV_INTDIVLNAMIXENAMP1_DEFAULT << 6)      /**< Shifted mode DEFAULT for RAC_ANTDIV         */
#define RAC_ANTDIV_INTDIVLNAMIXRFATTDCEN1                             (0x1UL << 7)                                       /**< INTDIVLNAMIXRFATTDCEN1                      */
#define _RAC_ANTDIV_INTDIVLNAMIXRFATTDCEN1_SHIFT                      7                                                  /**< Shift value for RAC_INTDIVLNAMIXRFATTDCEN1  */
#define _RAC_ANTDIV_INTDIVLNAMIXRFATTDCEN1_MASK                       0x80UL                                             /**< Bit mask for RAC_INTDIVLNAMIXRFATTDCEN1     */
#define _RAC_ANTDIV_INTDIVLNAMIXRFATTDCEN1_DEFAULT                    0x00000000UL                                       /**< Mode DEFAULT for RAC_ANTDIV                 */
#define RAC_ANTDIV_INTDIVLNAMIXRFATTDCEN1_DEFAULT                     (_RAC_ANTDIV_INTDIVLNAMIXRFATTDCEN1_DEFAULT << 7)  /**< Shifted mode DEFAULT for RAC_ANTDIV         */
#define RAC_ANTDIV_INTDIVLNAMIXRFPKDENRF1                             (0x1UL << 8)                                       /**< INTDIVLNAMIXRFPKDENRF1                      */
#define _RAC_ANTDIV_INTDIVLNAMIXRFPKDENRF1_SHIFT                      8                                                  /**< Shift value for RAC_INTDIVLNAMIXRFPKDENRF1  */
#define _RAC_ANTDIV_INTDIVLNAMIXRFPKDENRF1_MASK                       0x100UL                                            /**< Bit mask for RAC_INTDIVLNAMIXRFPKDENRF1     */
#define _RAC_ANTDIV_INTDIVLNAMIXRFPKDENRF1_DEFAULT                    0x00000000UL                                       /**< Mode DEFAULT for RAC_ANTDIV                 */
#define RAC_ANTDIV_INTDIVLNAMIXRFPKDENRF1_DEFAULT                     (_RAC_ANTDIV_INTDIVLNAMIXRFPKDENRF1_DEFAULT << 8)  /**< Shifted mode DEFAULT for RAC_ANTDIV         */
#define RAC_ANTDIV_INTDIVSYLODIVRLO1SUBGEN                            (0x1UL << 9)                                       /**< INTDIVSYLODIVRLO1SUBGEN                     */
#define _RAC_ANTDIV_INTDIVSYLODIVRLO1SUBGEN_SHIFT                     9                                                  /**< Shift value for RAC_INTDIVSYLODIVRLO1SUBGEN */
#define _RAC_ANTDIV_INTDIVSYLODIVRLO1SUBGEN_MASK                      0x200UL                                            /**< Bit mask for RAC_INTDIVSYLODIVRLO1SUBGEN    */
#define _RAC_ANTDIV_INTDIVSYLODIVRLO1SUBGEN_DEFAULT                   0x00000000UL                                       /**< Mode DEFAULT for RAC_ANTDIV                 */
#define RAC_ANTDIV_INTDIVSYLODIVRLO1SUBGEN_DEFAULT                    (_RAC_ANTDIV_INTDIVSYLODIVRLO1SUBGEN_DEFAULT << 9) /**< Shifted mode DEFAULT for RAC_ANTDIV         */
#define _RAC_ANTDIV_ANTDIVSTATUS_SHIFT                                10                                                 /**< Shift value for RAC_ANTDIVSTATUS            */
#define _RAC_ANTDIV_ANTDIVSTATUS_MASK                                 0xC00UL                                            /**< Bit mask for RAC_ANTDIVSTATUS               */
#define _RAC_ANTDIV_ANTDIVSTATUS_DEFAULT                              0x00000000UL                                       /**< Mode DEFAULT for RAC_ANTDIV                 */
#define _RAC_ANTDIV_ANTDIVSTATUS_OFF                                  0x00000000UL                                       /**< Mode OFF for RAC_ANTDIV                     */
#define _RAC_ANTDIV_ANTDIVSTATUS_ANT1                                 0x00000001UL                                       /**< Mode ANT1 for RAC_ANTDIV                    */
#define _RAC_ANTDIV_ANTDIVSTATUS_ANT2                                 0x00000002UL                                       /**< Mode ANT2 for RAC_ANTDIV                    */
#define _RAC_ANTDIV_ANTDIVSTATUS_BOTH                                 0x00000003UL                                       /**< Mode BOTH for RAC_ANTDIV                    */
#define RAC_ANTDIV_ANTDIVSTATUS_DEFAULT                               (_RAC_ANTDIV_ANTDIVSTATUS_DEFAULT << 10)           /**< Shifted mode DEFAULT for RAC_ANTDIV         */
#define RAC_ANTDIV_ANTDIVSTATUS_OFF                                   (_RAC_ANTDIV_ANTDIVSTATUS_OFF << 10)               /**< Shifted mode OFF for RAC_ANTDIV             */
#define RAC_ANTDIV_ANTDIVSTATUS_ANT1                                  (_RAC_ANTDIV_ANTDIVSTATUS_ANT1 << 10)              /**< Shifted mode ANT1 for RAC_ANTDIV            */
#define RAC_ANTDIV_ANTDIVSTATUS_ANT2                                  (_RAC_ANTDIV_ANTDIVSTATUS_ANT2 << 10)              /**< Shifted mode ANT2 for RAC_ANTDIV            */
#define RAC_ANTDIV_ANTDIVSTATUS_BOTH                                  (_RAC_ANTDIV_ANTDIVSTATUS_BOTH << 10)              /**< Shifted mode BOTH for RAC_ANTDIV            */

