SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/ZGM23/Include/zgm23_rac.h
/* Bit fields for RAC LNAMIXEN */
#define _RAC_LNAMIXEN_RESETVALUE                                      0x00000000UL                              /**< Default value for RAC_LNAMIXEN              */
#define _RAC_LNAMIXEN_MASK                                            0x0000000FUL                              /**< Mask for RAC_LNAMIXEN                       */
#define RAC_LNAMIXEN_LNAMIXENAMP0                                     (0x1UL << 0)                              /**< LNAMIXENAMP0                                */
#define _RAC_LNAMIXEN_LNAMIXENAMP0_SHIFT                              0                                         /**< Shift value for RAC_LNAMIXENAMP0            */
#define _RAC_LNAMIXEN_LNAMIXENAMP0_MASK                               0x1UL                                     /**< Bit mask for RAC_LNAMIXENAMP0               */
#define _RAC_LNAMIXEN_LNAMIXENAMP0_DEFAULT                            0x00000000UL                              /**< Mode DEFAULT for RAC_LNAMIXEN               */
#define _RAC_LNAMIXEN_LNAMIXENAMP0_disable                            0x00000000UL                              /**< Mode disable for RAC_LNAMIXEN               */
#define _RAC_LNAMIXEN_LNAMIXENAMP0_enable                             0x00000001UL                              /**< Mode enable for RAC_LNAMIXEN                */
#define RAC_LNAMIXEN_LNAMIXENAMP0_DEFAULT                             (_RAC_LNAMIXEN_LNAMIXENAMP0_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_LNAMIXEN       */
#define RAC_LNAMIXEN_LNAMIXENAMP0_disable                             (_RAC_LNAMIXEN_LNAMIXENAMP0_disable << 0) /**< Shifted mode disable for RAC_LNAMIXEN       */
#define RAC_LNAMIXEN_LNAMIXENAMP0_enable                              (_RAC_LNAMIXEN_LNAMIXENAMP0_enable << 0)  /**< Shifted mode enable for RAC_LNAMIXEN        */
#define RAC_LNAMIXEN_LNAMIXENAMP1                                     (0x1UL << 1)                              /**< LNAMIXENAMP1                                */
#define _RAC_LNAMIXEN_LNAMIXENAMP1_SHIFT                              1                                         /**< Shift value for RAC_LNAMIXENAMP1            */
#define _RAC_LNAMIXEN_LNAMIXENAMP1_MASK                               0x2UL                                     /**< Bit mask for RAC_LNAMIXENAMP1               */
#define _RAC_LNAMIXEN_LNAMIXENAMP1_DEFAULT                            0x00000000UL                              /**< Mode DEFAULT for RAC_LNAMIXEN               */
#define _RAC_LNAMIXEN_LNAMIXENAMP1_disable                            0x00000000UL                              /**< Mode disable for RAC_LNAMIXEN               */
#define _RAC_LNAMIXEN_LNAMIXENAMP1_enable                             0x00000001UL                              /**< Mode enable for RAC_LNAMIXEN                */
#define RAC_LNAMIXEN_LNAMIXENAMP1_DEFAULT                             (_RAC_LNAMIXEN_LNAMIXENAMP1_DEFAULT << 1) /**< Shifted mode DEFAULT for RAC_LNAMIXEN       */
#define RAC_LNAMIXEN_LNAMIXENAMP1_disable                             (_RAC_LNAMIXEN_LNAMIXENAMP1_disable << 1) /**< Shifted mode disable for RAC_LNAMIXEN       */
#define RAC_LNAMIXEN_LNAMIXENAMP1_enable                              (_RAC_LNAMIXEN_LNAMIXENAMP1_enable << 1)  /**< Shifted mode enable for RAC_LNAMIXEN        */
#define RAC_LNAMIXEN_LNAMIXENBIAS                                     (0x1UL << 2)                              /**< LNAMIXENBIAS                                */
#define _RAC_LNAMIXEN_LNAMIXENBIAS_SHIFT                              2                                         /**< Shift value for RAC_LNAMIXENBIAS            */
#define _RAC_LNAMIXEN_LNAMIXENBIAS_MASK                               0x4UL                                     /**< Bit mask for RAC_LNAMIXENBIAS               */
#define _RAC_LNAMIXEN_LNAMIXENBIAS_DEFAULT                            0x00000000UL                              /**< Mode DEFAULT for RAC_LNAMIXEN               */
#define _RAC_LNAMIXEN_LNAMIXENBIAS_disable                            0x00000000UL                              /**< Mode disable for RAC_LNAMIXEN               */
#define _RAC_LNAMIXEN_LNAMIXENBIAS_enable                             0x00000001UL                              /**< Mode enable for RAC_LNAMIXEN                */
#define RAC_LNAMIXEN_LNAMIXENBIAS_DEFAULT                             (_RAC_LNAMIXEN_LNAMIXENBIAS_DEFAULT << 2) /**< Shifted mode DEFAULT for RAC_LNAMIXEN       */
#define RAC_LNAMIXEN_LNAMIXENBIAS_disable                             (_RAC_LNAMIXEN_LNAMIXENBIAS_disable << 2) /**< Shifted mode disable for RAC_LNAMIXEN       */
#define RAC_LNAMIXEN_LNAMIXENBIAS_enable                              (_RAC_LNAMIXEN_LNAMIXENBIAS_enable << 2)  /**< Shifted mode enable for RAC_LNAMIXEN        */
#define RAC_LNAMIXEN_LNAMIXENLDO                                      (0x1UL << 3)                              /**< LNAMIXENLDO                                 */
#define _RAC_LNAMIXEN_LNAMIXENLDO_SHIFT                               3                                         /**< Shift value for RAC_LNAMIXENLDO             */
#define _RAC_LNAMIXEN_LNAMIXENLDO_MASK                                0x8UL                                     /**< Bit mask for RAC_LNAMIXENLDO                */
#define _RAC_LNAMIXEN_LNAMIXENLDO_DEFAULT                             0x00000000UL                              /**< Mode DEFAULT for RAC_LNAMIXEN               */
#define _RAC_LNAMIXEN_LNAMIXENLDO_disable                             0x00000000UL                              /**< Mode disable for RAC_LNAMIXEN               */
#define _RAC_LNAMIXEN_LNAMIXENLDO_enable                              0x00000001UL                              /**< Mode enable for RAC_LNAMIXEN                */
#define RAC_LNAMIXEN_LNAMIXENLDO_DEFAULT                              (_RAC_LNAMIXEN_LNAMIXENLDO_DEFAULT << 3)  /**< Shifted mode DEFAULT for RAC_LNAMIXEN       */
#define RAC_LNAMIXEN_LNAMIXENLDO_disable                              (_RAC_LNAMIXEN_LNAMIXENLDO_disable << 3)  /**< Shifted mode disable for RAC_LNAMIXEN       */
#define RAC_LNAMIXEN_LNAMIXENLDO_enable                               (_RAC_LNAMIXEN_LNAMIXENLDO_enable << 3)   /**< Shifted mode enable for RAC_LNAMIXEN        */

/* Bit fields for RAC PRECTRL */
#define _RAC_PRECTRL_RESETVALUE                                       0x00000026UL                               /**< Default value for RAC_PRECTRL               */
#define _RAC_PRECTRL_MASK                                             0x0000003FUL                               /**< Mask for RAC_PRECTRL                        */
#define RAC_PRECTRL_PREBYPFORCE                                       (0x1UL << 0)                               /**< PREBYPFORCE                                 */
#define _RAC_PRECTRL_PREBYPFORCE_SHIFT                                0                                          /**< Shift value for RAC_PREBYPFORCE             */
#define _RAC_PRECTRL_PREBYPFORCE_MASK                                 0x1UL                                      /**< Bit mask for RAC_PREBYPFORCE                */
#define _RAC_PRECTRL_PREBYPFORCE_DEFAULT                              0x00000000UL                               /**< Mode DEFAULT for RAC_PRECTRL                */
#define _RAC_PRECTRL_PREBYPFORCE_not_forced                           0x00000000UL                               /**< Mode not_forced for RAC_PRECTRL             */
#define _RAC_PRECTRL_PREBYPFORCE_forced                               0x00000001UL                               /**< Mode forced for RAC_PRECTRL                 */
#define RAC_PRECTRL_PREBYPFORCE_DEFAULT                               (_RAC_PRECTRL_PREBYPFORCE_DEFAULT << 0)    /**< Shifted mode DEFAULT for RAC_PRECTRL        */
#define RAC_PRECTRL_PREBYPFORCE_not_forced                            (_RAC_PRECTRL_PREBYPFORCE_not_forced << 0) /**< Shifted mode not_forced for RAC_PRECTRL     */
#define RAC_PRECTRL_PREBYPFORCE_forced                                (_RAC_PRECTRL_PREBYPFORCE_forced << 0)     /**< Shifted mode forced for RAC_PRECTRL         */
#define _RAC_PRECTRL_PREREGTRIM_SHIFT                                 1                                          /**< Shift value for RAC_PREREGTRIM              */
#define _RAC_PRECTRL_PREREGTRIM_MASK                                  0xEUL                                      /**< Bit mask for RAC_PREREGTRIM                 */
#define _RAC_PRECTRL_PREREGTRIM_DEFAULT                               0x00000003UL                               /**< Mode DEFAULT for RAC_PRECTRL                */
#define _RAC_PRECTRL_PREREGTRIM_v1p61                                 0x00000000UL                               /**< Mode v1p61 for RAC_PRECTRL                  */
#define _RAC_PRECTRL_PREREGTRIM_v1p68                                 0x00000001UL                               /**< Mode v1p68 for RAC_PRECTRL                  */
#define _RAC_PRECTRL_PREREGTRIM_v1p74                                 0x00000002UL                               /**< Mode v1p74 for RAC_PRECTRL                  */
#define _RAC_PRECTRL_PREREGTRIM_v1p80                                 0x00000003UL                               /**< Mode v1p80 for RAC_PRECTRL                  */
#define _RAC_PRECTRL_PREREGTRIM_v1p86                                 0x00000004UL                               /**< Mode v1p86 for RAC_PRECTRL                  */
#define _RAC_PRECTRL_PREREGTRIM_v1p91                                 0x00000005UL                               /**< Mode v1p91 for RAC_PRECTRL                  */
#define _RAC_PRECTRL_PREREGTRIM_v1p96                                 0x00000006UL                               /**< Mode v1p96 for RAC_PRECTRL                  */
#define _RAC_PRECTRL_PREREGTRIM_v2p00                                 0x00000007UL                               /**< Mode v2p00 for RAC_PRECTRL                  */
#define RAC_PRECTRL_PREREGTRIM_DEFAULT                                (_RAC_PRECTRL_PREREGTRIM_DEFAULT << 1)     /**< Shifted mode DEFAULT for RAC_PRECTRL        */
#define RAC_PRECTRL_PREREGTRIM_v1p61                                  (_RAC_PRECTRL_PREREGTRIM_v1p61 << 1)       /**< Shifted mode v1p61 for RAC_PRECTRL          */
#define RAC_PRECTRL_PREREGTRIM_v1p68                                  (_RAC_PRECTRL_PREREGTRIM_v1p68 << 1)       /**< Shifted mode v1p68 for RAC_PRECTRL          */
#define RAC_PRECTRL_PREREGTRIM_v1p74                                  (_RAC_PRECTRL_PREREGTRIM_v1p74 << 1)       /**< Shifted mode v1p74 for RAC_PRECTRL          */
#define RAC_PRECTRL_PREREGTRIM_v1p80                                  (_RAC_PRECTRL_PREREGTRIM_v1p80 << 1)       /**< Shifted mode v1p80 for RAC_PRECTRL          */
#define RAC_PRECTRL_PREREGTRIM_v1p86                                  (_RAC_PRECTRL_PREREGTRIM_v1p86 << 1)       /**< Shifted mode v1p86 for RAC_PRECTRL          */
#define RAC_PRECTRL_PREREGTRIM_v1p91                                  (_RAC_PRECTRL_PREREGTRIM_v1p91 << 1)       /**< Shifted mode v1p91 for RAC_PRECTRL          */
#define RAC_PRECTRL_PREREGTRIM_v1p96                                  (_RAC_PRECTRL_PREREGTRIM_v1p96 << 1)       /**< Shifted mode v1p96 for RAC_PRECTRL          */
#define RAC_PRECTRL_PREREGTRIM_v2p00                                  (_RAC_PRECTRL_PREREGTRIM_v2p00 << 1)       /**< Shifted mode v2p00 for RAC_PRECTRL          */
#define _RAC_PRECTRL_PREVREFTRIM_SHIFT                                4                                          /**< Shift value for RAC_PREVREFTRIM             */
#define _RAC_PRECTRL_PREVREFTRIM_MASK                                 0x30UL                                     /**< Bit mask for RAC_PREVREFTRIM                */
#define _RAC_PRECTRL_PREVREFTRIM_DEFAULT                              0x00000002UL                               /**< Mode DEFAULT for RAC_PRECTRL                */
#define _RAC_PRECTRL_PREVREFTRIM_v0p675                               0x00000000UL                               /**< Mode v0p675 for RAC_PRECTRL                 */
#define _RAC_PRECTRL_PREVREFTRIM_v0p688                               0x00000001UL                               /**< Mode v0p688 for RAC_PRECTRL                 */
#define _RAC_PRECTRL_PREVREFTRIM_v0p700                               0x00000002UL                               /**< Mode v0p700 for RAC_PRECTRL                 */
#define _RAC_PRECTRL_PREVREFTRIM_v0p713                               0x00000003UL                               /**< Mode v0p713 for RAC_PRECTRL                 */
#define RAC_PRECTRL_PREVREFTRIM_DEFAULT                               (_RAC_PRECTRL_PREVREFTRIM_DEFAULT << 4)    /**< Shifted mode DEFAULT for RAC_PRECTRL        */
#define RAC_PRECTRL_PREVREFTRIM_v0p675                                (_RAC_PRECTRL_PREVREFTRIM_v0p675 << 4)     /**< Shifted mode v0p675 for RAC_PRECTRL         */
#define RAC_PRECTRL_PREVREFTRIM_v0p688                                (_RAC_PRECTRL_PREVREFTRIM_v0p688 << 4)     /**< Shifted mode v0p688 for RAC_PRECTRL         */
#define RAC_PRECTRL_PREVREFTRIM_v0p700                                (_RAC_PRECTRL_PREVREFTRIM_v0p700 << 4)     /**< Shifted mode v0p700 for RAC_PRECTRL         */
#define RAC_PRECTRL_PREVREFTRIM_v0p713                                (_RAC_PRECTRL_PREVREFTRIM_v0p713 << 4)     /**< Shifted mode v0p713 for RAC_PRECTRL         */

/* Bit fields for RAC PATRIM0 */
#define _RAC_PATRIM0_RESETVALUE                                       0x00000000UL                                /**< Default value for RAC_PATRIM0               */
#define _RAC_PATRIM0_MASK                                             0x00000003UL                                /**< Mask for RAC_PATRIM0                        */
#define _RAC_PATRIM0_TXTRIMLPAVMID_SHIFT                              0                                           /**< Shift value for RAC_TXTRIMLPAVMID           */
#define _RAC_PATRIM0_TXTRIMLPAVMID_MASK                               0x3UL                                       /**< Bit mask for RAC_TXTRIMLPAVMID              */
#define _RAC_PATRIM0_TXTRIMLPAVMID_DEFAULT                            0x00000000UL                                /**< Mode DEFAULT for RAC_PATRIM0                */
#define _RAC_PATRIM0_TXTRIMLPAVMID_noeffect0                          0x00000000UL                                /**< Mode noeffect0 for RAC_PATRIM0              */
#define _RAC_PATRIM0_TXTRIMLPAVMID_noeffect1                          0x00000001UL                                /**< Mode noeffect1 for RAC_PATRIM0              */
#define _RAC_PATRIM0_TXTRIMLPAVMID_noeffec2                           0x00000002UL                                /**< Mode noeffec2 for RAC_PATRIM0               */
#define _RAC_PATRIM0_TXTRIMLPAVMID_noeffect3                          0x00000003UL                                /**< Mode noeffect3 for RAC_PATRIM0              */
#define RAC_PATRIM0_TXTRIMLPAVMID_DEFAULT                             (_RAC_PATRIM0_TXTRIMLPAVMID_DEFAULT << 0)   /**< Shifted mode DEFAULT for RAC_PATRIM0        */
#define RAC_PATRIM0_TXTRIMLPAVMID_noeffect0                           (_RAC_PATRIM0_TXTRIMLPAVMID_noeffect0 << 0) /**< Shifted mode noeffect0 for RAC_PATRIM0      */
#define RAC_PATRIM0_TXTRIMLPAVMID_noeffect1                           (_RAC_PATRIM0_TXTRIMLPAVMID_noeffect1 << 0) /**< Shifted mode noeffect1 for RAC_PATRIM0      */
#define RAC_PATRIM0_TXTRIMLPAVMID_noeffec2                            (_RAC_PATRIM0_TXTRIMLPAVMID_noeffec2 << 0)  /**< Shifted mode noeffec2 for RAC_PATRIM0       */
#define RAC_PATRIM0_TXTRIMLPAVMID_noeffect3                           (_RAC_PATRIM0_TXTRIMLPAVMID_noeffect3 << 0) /**< Shifted mode noeffect3 for RAC_PATRIM0      */

