SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/ZGM23/Include/zgm23_rac.h
/* Bit fields for RAC PATRIM1 */
#define _RAC_PATRIM1_RESETVALUE                                       0x0000235BUL                                 /**< Default value for RAC_PATRIM1               */
#define _RAC_PATRIM1_MASK                                             0x00003FFFUL                                 /**< Mask for RAC_PATRIM1                        */
#define _RAC_PATRIM1_TXTRIMXPAVNB_SHIFT                               0                                            /**< Shift value for RAC_TXTRIMXPAVNB            */
#define _RAC_PATRIM1_TXTRIMXPAVNB_MASK                                0x7UL                                        /**< Bit mask for RAC_TXTRIMXPAVNB               */
#define _RAC_PATRIM1_TXTRIMXPAVNB_DEFAULT                             0x00000003UL                                 /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_TXTRIMXPAVNB_ovdd0p45                            0x00000000UL                                 /**< Mode ovdd0p45 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMXPAVNB_ovdd0p50                            0x00000001UL                                 /**< Mode ovdd0p50 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMXPAVNB_ovdd0p55                            0x00000002UL                                 /**< Mode ovdd0p55 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMXPAVNB_ovdd0p60                            0x00000003UL                                 /**< Mode ovdd0p60 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMXPAVNB_ovdd0p65                            0x00000004UL                                 /**< Mode ovdd0p65 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMXPAVNB_ovdd0p70                            0x00000005UL                                 /**< Mode ovdd0p70 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMXPAVNB_ovdd0p75                            0x00000006UL                                 /**< Mode ovdd0p75 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMXPAVNB_ovdd0p80                            0x00000007UL                                 /**< Mode ovdd0p80 for RAC_PATRIM1               */
#define RAC_PATRIM1_TXTRIMXPAVNB_DEFAULT                              (_RAC_PATRIM1_TXTRIMXPAVNB_DEFAULT << 0)     /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_TXTRIMXPAVNB_ovdd0p45                             (_RAC_PATRIM1_TXTRIMXPAVNB_ovdd0p45 << 0)    /**< Shifted mode ovdd0p45 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMXPAVNB_ovdd0p50                             (_RAC_PATRIM1_TXTRIMXPAVNB_ovdd0p50 << 0)    /**< Shifted mode ovdd0p50 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMXPAVNB_ovdd0p55                             (_RAC_PATRIM1_TXTRIMXPAVNB_ovdd0p55 << 0)    /**< Shifted mode ovdd0p55 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMXPAVNB_ovdd0p60                             (_RAC_PATRIM1_TXTRIMXPAVNB_ovdd0p60 << 0)    /**< Shifted mode ovdd0p60 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMXPAVNB_ovdd0p65                             (_RAC_PATRIM1_TXTRIMXPAVNB_ovdd0p65 << 0)    /**< Shifted mode ovdd0p65 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMXPAVNB_ovdd0p70                             (_RAC_PATRIM1_TXTRIMXPAVNB_ovdd0p70 << 0)    /**< Shifted mode ovdd0p70 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMXPAVNB_ovdd0p75                             (_RAC_PATRIM1_TXTRIMXPAVNB_ovdd0p75 << 0)    /**< Shifted mode ovdd0p75 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMXPAVNB_ovdd0p80                             (_RAC_PATRIM1_TXTRIMXPAVNB_ovdd0p80 << 0)    /**< Shifted mode ovdd0p80 for RAC_PATRIM1       */
#define _RAC_PATRIM1_TXTRIMXPAVPB_SHIFT                               3                                            /**< Shift value for RAC_TXTRIMXPAVPB            */
#define _RAC_PATRIM1_TXTRIMXPAVPB_MASK                                0x38UL                                       /**< Bit mask for RAC_TXTRIMXPAVPB               */
#define _RAC_PATRIM1_TXTRIMXPAVPB_DEFAULT                             0x00000003UL                                 /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_TXTRIMXPAVPB_ognd0p45                            0x00000000UL                                 /**< Mode ognd0p45 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMXPAVPB_ognd0p50                            0x00000001UL                                 /**< Mode ognd0p50 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMXPAVPB_ognd0p55                            0x00000002UL                                 /**< Mode ognd0p55 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMXPAVPB_ognd0p60                            0x00000003UL                                 /**< Mode ognd0p60 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMXPAVPB_ognd0p65                            0x00000004UL                                 /**< Mode ognd0p65 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMXPAVPB_ognd0p70                            0x00000005UL                                 /**< Mode ognd0p70 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMXPAVPB_ognd0p75                            0x00000006UL                                 /**< Mode ognd0p75 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMXPAVPB_ognd0p80                            0x00000007UL                                 /**< Mode ognd0p80 for RAC_PATRIM1               */
#define RAC_PATRIM1_TXTRIMXPAVPB_DEFAULT                              (_RAC_PATRIM1_TXTRIMXPAVPB_DEFAULT << 3)     /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_TXTRIMXPAVPB_ognd0p45                             (_RAC_PATRIM1_TXTRIMXPAVPB_ognd0p45 << 3)    /**< Shifted mode ognd0p45 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMXPAVPB_ognd0p50                             (_RAC_PATRIM1_TXTRIMXPAVPB_ognd0p50 << 3)    /**< Shifted mode ognd0p50 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMXPAVPB_ognd0p55                             (_RAC_PATRIM1_TXTRIMXPAVPB_ognd0p55 << 3)    /**< Shifted mode ognd0p55 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMXPAVPB_ognd0p60                             (_RAC_PATRIM1_TXTRIMXPAVPB_ognd0p60 << 3)    /**< Shifted mode ognd0p60 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMXPAVPB_ognd0p65                             (_RAC_PATRIM1_TXTRIMXPAVPB_ognd0p65 << 3)    /**< Shifted mode ognd0p65 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMXPAVPB_ognd0p70                             (_RAC_PATRIM1_TXTRIMXPAVPB_ognd0p70 << 3)    /**< Shifted mode ognd0p70 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMXPAVPB_ognd0p75                             (_RAC_PATRIM1_TXTRIMXPAVPB_ognd0p75 << 3)    /**< Shifted mode ognd0p75 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMXPAVPB_ognd0p80                             (_RAC_PATRIM1_TXTRIMXPAVPB_ognd0p80 << 3)    /**< Shifted mode ognd0p80 for RAC_PATRIM1       */
#define _RAC_PATRIM1_TXTRIMHPAVMID_SHIFT                              6                                            /**< Shift value for RAC_TXTRIMHPAVMID           */
#define _RAC_PATRIM1_TXTRIMHPAVMID_MASK                               0xC0UL                                       /**< Bit mask for RAC_TXTRIMHPAVMID              */
#define _RAC_PATRIM1_TXTRIMHPAVMID_DEFAULT                            0x00000001UL                                 /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_TXTRIMHPAVMID_noeffect0                          0x00000000UL                                 /**< Mode noeffect0 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMHPAVMID_noeffect1                          0x00000001UL                                 /**< Mode noeffect1 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMHPAVMID_noeffect2                          0x00000002UL                                 /**< Mode noeffect2 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMHPAVMID_noeffect3                          0x00000003UL                                 /**< Mode noeffect3 for RAC_PATRIM1              */
#define RAC_PATRIM1_TXTRIMHPAVMID_DEFAULT                             (_RAC_PATRIM1_TXTRIMHPAVMID_DEFAULT << 6)    /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_TXTRIMHPAVMID_noeffect0                           (_RAC_PATRIM1_TXTRIMHPAVMID_noeffect0 << 6)  /**< Shifted mode noeffect0 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMHPAVMID_noeffect1                           (_RAC_PATRIM1_TXTRIMHPAVMID_noeffect1 << 6)  /**< Shifted mode noeffect1 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMHPAVMID_noeffect2                           (_RAC_PATRIM1_TXTRIMHPAVMID_noeffect2 << 6)  /**< Shifted mode noeffect2 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMHPAVMID_noeffect3                           (_RAC_PATRIM1_TXTRIMHPAVMID_noeffect3 << 6)  /**< Shifted mode noeffect3 for RAC_PATRIM1      */
#define _RAC_PATRIM1_TXTRIMHPAVNCAS_SHIFT                             8                                            /**< Shift value for RAC_TXTRIMHPAVNCAS          */
#define _RAC_PATRIM1_TXTRIMHPAVNCAS_MASK                              0x700UL                                      /**< Bit mask for RAC_TXTRIMHPAVNCAS             */
#define _RAC_PATRIM1_TXTRIMHPAVNCAS_DEFAULT                           0x00000003UL                                 /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p50                          0x00000000UL                                 /**< Mode ognd1p50 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p55                          0x00000001UL                                 /**< Mode ognd1p55 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p60                          0x00000002UL                                 /**< Mode ognd1p60 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p65                          0x00000003UL                                 /**< Mode ognd1p65 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p70                          0x00000004UL                                 /**< Mode ognd1p70 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p75                          0x00000005UL                                 /**< Mode ognd1p75 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p80                          0x00000006UL                                 /**< Mode ognd1p80 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p85                          0x00000007UL                                 /**< Mode ognd1p85 for RAC_PATRIM1               */
#define RAC_PATRIM1_TXTRIMHPAVNCAS_DEFAULT                            (_RAC_PATRIM1_TXTRIMHPAVNCAS_DEFAULT << 8)   /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p50                           (_RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p50 << 8)  /**< Shifted mode ognd1p50 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p55                           (_RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p55 << 8)  /**< Shifted mode ognd1p55 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p60                           (_RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p60 << 8)  /**< Shifted mode ognd1p60 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p65                           (_RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p65 << 8)  /**< Shifted mode ognd1p65 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p70                           (_RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p70 << 8)  /**< Shifted mode ognd1p70 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p75                           (_RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p75 << 8)  /**< Shifted mode ognd1p75 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p80                           (_RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p80 << 8)  /**< Shifted mode ognd1p80 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p85                           (_RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p85 << 8)  /**< Shifted mode ognd1p85 for RAC_PATRIM1       */
#define _RAC_PATRIM1_TXTRIMHPAVPCAS_SHIFT                             11                                           /**< Shift value for RAC_TXTRIMHPAVPCAS          */
#define _RAC_PATRIM1_TXTRIMHPAVPCAS_MASK                              0x3800UL                                     /**< Bit mask for RAC_TXTRIMHPAVPCAS             */
#define _RAC_PATRIM1_TXTRIMHPAVPCAS_DEFAULT                           0x00000004UL                                 /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p30                          0x00000000UL                                 /**< Mode ovdd1p30 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p35                          0x00000001UL                                 /**< Mode ovdd1p35 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p40                          0x00000002UL                                 /**< Mode ovdd1p40 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p45                          0x00000003UL                                 /**< Mode ovdd1p45 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p50                          0x00000004UL                                 /**< Mode ovdd1p50 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p55                          0x00000005UL                                 /**< Mode ovdd1p55 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p60                          0x00000006UL                                 /**< Mode ovdd1p60 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p65                          0x00000007UL                                 /**< Mode ovdd1p65 for RAC_PATRIM1               */
#define RAC_PATRIM1_TXTRIMHPAVPCAS_DEFAULT                            (_RAC_PATRIM1_TXTRIMHPAVPCAS_DEFAULT << 11)  /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p30                           (_RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p30 << 11) /**< Shifted mode ovdd1p30 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p35                           (_RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p35 << 11) /**< Shifted mode ovdd1p35 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p40                           (_RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p40 << 11) /**< Shifted mode ovdd1p40 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p45                           (_RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p45 << 11) /**< Shifted mode ovdd1p45 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p50                           (_RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p50 << 11) /**< Shifted mode ovdd1p50 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p55                           (_RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p55 << 11) /**< Shifted mode ovdd1p55 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p60                           (_RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p60 << 11) /**< Shifted mode ovdd1p60 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p65                           (_RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p65 << 11) /**< Shifted mode ovdd1p65 for RAC_PATRIM1       */

