SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/ZGM23/Include/zgm23_rac.h
/* Bit fields for RAC PATRIM5 */
#define _RAC_PATRIM5_RESETVALUE                                       0x000000FCUL                              /**< Default value for RAC_PATRIM5               */
#define _RAC_PATRIM5_MASK                                             0x000000FFUL                              /**< Mask for RAC_PATRIM5                        */
#define RAC_PATRIM5_TXVNSRAIL                                         (0x1UL << 0)                              /**< TXVNSRAIL                                   */
#define _RAC_PATRIM5_TXVNSRAIL_SHIFT                                  0                                         /**< Shift value for RAC_TXVNSRAIL               */
#define _RAC_PATRIM5_TXVNSRAIL_MASK                                   0x1UL                                     /**< Bit mask for RAC_TXVNSRAIL                  */
#define _RAC_PATRIM5_TXVNSRAIL_DEFAULT                                0x00000000UL                              /**< Mode DEFAULT for RAC_PATRIM5                */
#define _RAC_PATRIM5_TXVNSRAIL_disable                                0x00000000UL                              /**< Mode disable for RAC_PATRIM5                */
#define _RAC_PATRIM5_TXVNSRAIL_enable                                 0x00000001UL                              /**< Mode enable for RAC_PATRIM5                 */
#define RAC_PATRIM5_TXVNSRAIL_DEFAULT                                 (_RAC_PATRIM5_TXVNSRAIL_DEFAULT << 0)     /**< Shifted mode DEFAULT for RAC_PATRIM5        */
#define RAC_PATRIM5_TXVNSRAIL_disable                                 (_RAC_PATRIM5_TXVNSRAIL_disable << 0)     /**< Shifted mode disable for RAC_PATRIM5        */
#define RAC_PATRIM5_TXVNSRAIL_enable                                  (_RAC_PATRIM5_TXVNSRAIL_enable << 0)      /**< Shifted mode enable for RAC_PATRIM5         */
#define RAC_PATRIM5_TXVPSRAIL                                         (0x1UL << 1)                              /**< TXVPSRAIL                                   */
#define _RAC_PATRIM5_TXVPSRAIL_SHIFT                                  1                                         /**< Shift value for RAC_TXVPSRAIL               */
#define _RAC_PATRIM5_TXVPSRAIL_MASK                                   0x2UL                                     /**< Bit mask for RAC_TXVPSRAIL                  */
#define _RAC_PATRIM5_TXVPSRAIL_DEFAULT                                0x00000000UL                              /**< Mode DEFAULT for RAC_PATRIM5                */
#define _RAC_PATRIM5_TXVPSRAIL_disable                                0x00000000UL                              /**< Mode disable for RAC_PATRIM5                */
#define _RAC_PATRIM5_TXVPSRAIL_enable                                 0x00000001UL                              /**< Mode enable for RAC_PATRIM5                 */
#define RAC_PATRIM5_TXVPSRAIL_DEFAULT                                 (_RAC_PATRIM5_TXVPSRAIL_DEFAULT << 1)     /**< Shifted mode DEFAULT for RAC_PATRIM5        */
#define RAC_PATRIM5_TXVPSRAIL_disable                                 (_RAC_PATRIM5_TXVPSRAIL_disable << 1)     /**< Shifted mode disable for RAC_PATRIM5        */
#define RAC_PATRIM5_TXVPSRAIL_enable                                  (_RAC_PATRIM5_TXVPSRAIL_enable << 1)      /**< Shifted mode enable for RAC_PATRIM5         */
#define _RAC_PATRIM5_TXTRIMXPAVNS_SHIFT                               2                                         /**< Shift value for RAC_TXTRIMXPAVNS            */
#define _RAC_PATRIM5_TXTRIMXPAVNS_MASK                                0x1CUL                                    /**< Bit mask for RAC_TXTRIMXPAVNS               */
#define _RAC_PATRIM5_TXTRIMXPAVNS_DEFAULT                             0x00000007UL                              /**< Mode DEFAULT for RAC_PATRIM5                */
#define _RAC_PATRIM5_TXTRIMXPAVNS_ognd1p07                            0x00000000UL                              /**< Mode ognd1p07 for RAC_PATRIM5               */
#define _RAC_PATRIM5_TXTRIMXPAVNS_ognd1p12                            0x00000001UL                              /**< Mode ognd1p12 for RAC_PATRIM5               */
#define _RAC_PATRIM5_TXTRIMXPAVNS_ognd1p18                            0x00000002UL                              /**< Mode ognd1p18 for RAC_PATRIM5               */
#define _RAC_PATRIM5_TXTRIMXPAVNS_ognd1p25                            0x00000003UL                              /**< Mode ognd1p25 for RAC_PATRIM5               */
#define _RAC_PATRIM5_TXTRIMXPAVNS_ognd1p34                            0x00000004UL                              /**< Mode ognd1p34 for RAC_PATRIM5               */
#define _RAC_PATRIM5_TXTRIMXPAVNS_ognd1p43                            0x00000005UL                              /**< Mode ognd1p43 for RAC_PATRIM5               */
#define _RAC_PATRIM5_TXTRIMXPAVNS_ognd1p53                            0x00000006UL                              /**< Mode ognd1p53 for RAC_PATRIM5               */
#define _RAC_PATRIM5_TXTRIMXPAVNS_ognd1p63                            0x00000007UL                              /**< Mode ognd1p63 for RAC_PATRIM5               */
#define RAC_PATRIM5_TXTRIMXPAVNS_DEFAULT                              (_RAC_PATRIM5_TXTRIMXPAVNS_DEFAULT << 2)  /**< Shifted mode DEFAULT for RAC_PATRIM5        */
#define RAC_PATRIM5_TXTRIMXPAVNS_ognd1p07                             (_RAC_PATRIM5_TXTRIMXPAVNS_ognd1p07 << 2) /**< Shifted mode ognd1p07 for RAC_PATRIM5       */
#define RAC_PATRIM5_TXTRIMXPAVNS_ognd1p12                             (_RAC_PATRIM5_TXTRIMXPAVNS_ognd1p12 << 2) /**< Shifted mode ognd1p12 for RAC_PATRIM5       */
#define RAC_PATRIM5_TXTRIMXPAVNS_ognd1p18                             (_RAC_PATRIM5_TXTRIMXPAVNS_ognd1p18 << 2) /**< Shifted mode ognd1p18 for RAC_PATRIM5       */
#define RAC_PATRIM5_TXTRIMXPAVNS_ognd1p25                             (_RAC_PATRIM5_TXTRIMXPAVNS_ognd1p25 << 2) /**< Shifted mode ognd1p25 for RAC_PATRIM5       */
#define RAC_PATRIM5_TXTRIMXPAVNS_ognd1p34                             (_RAC_PATRIM5_TXTRIMXPAVNS_ognd1p34 << 2) /**< Shifted mode ognd1p34 for RAC_PATRIM5       */
#define RAC_PATRIM5_TXTRIMXPAVNS_ognd1p43                             (_RAC_PATRIM5_TXTRIMXPAVNS_ognd1p43 << 2) /**< Shifted mode ognd1p43 for RAC_PATRIM5       */
#define RAC_PATRIM5_TXTRIMXPAVNS_ognd1p53                             (_RAC_PATRIM5_TXTRIMXPAVNS_ognd1p53 << 2) /**< Shifted mode ognd1p53 for RAC_PATRIM5       */
#define RAC_PATRIM5_TXTRIMXPAVNS_ognd1p63                             (_RAC_PATRIM5_TXTRIMXPAVNS_ognd1p63 << 2) /**< Shifted mode ognd1p63 for RAC_PATRIM5       */
#define _RAC_PATRIM5_TXTRIMXPAVPS_SHIFT                               5                                         /**< Shift value for RAC_TXTRIMXPAVPS            */
#define _RAC_PATRIM5_TXTRIMXPAVPS_MASK                                0xE0UL                                    /**< Bit mask for RAC_TXTRIMXPAVPS               */
#define _RAC_PATRIM5_TXTRIMXPAVPS_DEFAULT                             0x00000007UL                              /**< Mode DEFAULT for RAC_PATRIM5                */
#define _RAC_PATRIM5_TXTRIMXPAVPS_ovdd1p03                            0x00000000UL                              /**< Mode ovdd1p03 for RAC_PATRIM5               */
#define _RAC_PATRIM5_TXTRIMXPAVPS_ovdd1p08                            0x00000001UL                              /**< Mode ovdd1p08 for RAC_PATRIM5               */
#define _RAC_PATRIM5_TXTRIMXPAVPS_ovdd1p14                            0x00000002UL                              /**< Mode ovdd1p14 for RAC_PATRIM5               */
#define _RAC_PATRIM5_TXTRIMXPAVPS_ovdd1p19                            0x00000003UL                              /**< Mode ovdd1p19 for RAC_PATRIM5               */
#define _RAC_PATRIM5_TXTRIMXPAVPS_ovdd1p24                            0x00000004UL                              /**< Mode ovdd1p24 for RAC_PATRIM5               */
#define _RAC_PATRIM5_TXTRIMXPAVPS_ovdd1p30                            0x00000005UL                              /**< Mode ovdd1p30 for RAC_PATRIM5               */
#define _RAC_PATRIM5_TXTRIMXPAVPS_ovdd1p40                            0x00000006UL                              /**< Mode ovdd1p40 for RAC_PATRIM5               */
#define _RAC_PATRIM5_TXTRIMXPAVPS_ovdd1p50                            0x00000007UL                              /**< Mode ovdd1p50 for RAC_PATRIM5               */
#define RAC_PATRIM5_TXTRIMXPAVPS_DEFAULT                              (_RAC_PATRIM5_TXTRIMXPAVPS_DEFAULT << 5)  /**< Shifted mode DEFAULT for RAC_PATRIM5        */
#define RAC_PATRIM5_TXTRIMXPAVPS_ovdd1p03                             (_RAC_PATRIM5_TXTRIMXPAVPS_ovdd1p03 << 5) /**< Shifted mode ovdd1p03 for RAC_PATRIM5       */
#define RAC_PATRIM5_TXTRIMXPAVPS_ovdd1p08                             (_RAC_PATRIM5_TXTRIMXPAVPS_ovdd1p08 << 5) /**< Shifted mode ovdd1p08 for RAC_PATRIM5       */
#define RAC_PATRIM5_TXTRIMXPAVPS_ovdd1p14                             (_RAC_PATRIM5_TXTRIMXPAVPS_ovdd1p14 << 5) /**< Shifted mode ovdd1p14 for RAC_PATRIM5       */
#define RAC_PATRIM5_TXTRIMXPAVPS_ovdd1p19                             (_RAC_PATRIM5_TXTRIMXPAVPS_ovdd1p19 << 5) /**< Shifted mode ovdd1p19 for RAC_PATRIM5       */
#define RAC_PATRIM5_TXTRIMXPAVPS_ovdd1p24                             (_RAC_PATRIM5_TXTRIMXPAVPS_ovdd1p24 << 5) /**< Shifted mode ovdd1p24 for RAC_PATRIM5       */
#define RAC_PATRIM5_TXTRIMXPAVPS_ovdd1p30                             (_RAC_PATRIM5_TXTRIMXPAVPS_ovdd1p30 << 5) /**< Shifted mode ovdd1p30 for RAC_PATRIM5       */
#define RAC_PATRIM5_TXTRIMXPAVPS_ovdd1p40                             (_RAC_PATRIM5_TXTRIMXPAVPS_ovdd1p40 << 5) /**< Shifted mode ovdd1p40 for RAC_PATRIM5       */
#define RAC_PATRIM5_TXTRIMXPAVPS_ovdd1p50                             (_RAC_PATRIM5_TXTRIMXPAVPS_ovdd1p50 << 5) /**< Shifted mode ovdd1p50 for RAC_PATRIM5       */

/* Bit fields for RAC PADEBUG0 */
#define _RAC_PADEBUG0_RESETVALUE                                      0x00000000UL                                       /**< Default value for RAC_PADEBUG0              */
#define _RAC_PADEBUG0_MASK                                            0x0000000FUL                                       /**< Mask for RAC_PADEBUG0                       */
#define RAC_PADEBUG0_TXOREGBYPASS                                     (0x1UL << 0)                                       /**< TXOREGBYPASS                                */
#define _RAC_PADEBUG0_TXOREGBYPASS_SHIFT                              0                                                  /**< Shift value for RAC_TXOREGBYPASS            */
#define _RAC_PADEBUG0_TXOREGBYPASS_MASK                               0x1UL                                              /**< Bit mask for RAC_TXOREGBYPASS               */
#define _RAC_PADEBUG0_TXOREGBYPASS_DEFAULT                            0x00000000UL                                       /**< Mode DEFAULT for RAC_PADEBUG0               */
#define _RAC_PADEBUG0_TXOREGBYPASS_disable                            0x00000000UL                                       /**< Mode disable for RAC_PADEBUG0               */
#define _RAC_PADEBUG0_TXOREGBYPASS_enable                             0x00000001UL                                       /**< Mode enable for RAC_PADEBUG0                */
#define RAC_PADEBUG0_TXOREGBYPASS_DEFAULT                             (_RAC_PADEBUG0_TXOREGBYPASS_DEFAULT << 0)          /**< Shifted mode DEFAULT for RAC_PADEBUG0       */
#define RAC_PADEBUG0_TXOREGBYPASS_disable                             (_RAC_PADEBUG0_TXOREGBYPASS_disable << 0)          /**< Shifted mode disable for RAC_PADEBUG0       */
#define RAC_PADEBUG0_TXOREGBYPASS_enable                              (_RAC_PADEBUG0_TXOREGBYPASS_enable << 0)           /**< Shifted mode enable for RAC_PADEBUG0        */
#define RAC_PADEBUG0_TXDREGBYPASS                                     (0x1UL << 1)                                       /**< TXDREGBYPASS                                */
#define _RAC_PADEBUG0_TXDREGBYPASS_SHIFT                              1                                                  /**< Shift value for RAC_TXDREGBYPASS            */
#define _RAC_PADEBUG0_TXDREGBYPASS_MASK                               0x2UL                                              /**< Bit mask for RAC_TXDREGBYPASS               */
#define _RAC_PADEBUG0_TXDREGBYPASS_DEFAULT                            0x00000000UL                                       /**< Mode DEFAULT for RAC_PADEBUG0               */
#define _RAC_PADEBUG0_TXDREGBYPASS_disable_bypass                     0x00000000UL                                       /**< Mode disable_bypass for RAC_PADEBUG0        */
#define _RAC_PADEBUG0_TXDREGBYPASS_enable_bypass                      0x00000001UL                                       /**< Mode enable_bypass for RAC_PADEBUG0         */
#define RAC_PADEBUG0_TXDREGBYPASS_DEFAULT                             (_RAC_PADEBUG0_TXDREGBYPASS_DEFAULT << 1)          /**< Shifted mode DEFAULT for RAC_PADEBUG0       */
#define RAC_PADEBUG0_TXDREGBYPASS_disable_bypass                      (_RAC_PADEBUG0_TXDREGBYPASS_disable_bypass << 1)   /**< Shifted mode disable_bypass for RAC_PADEBUG0*/
#define RAC_PADEBUG0_TXDREGBYPASS_enable_bypass                       (_RAC_PADEBUG0_TXDREGBYPASS_enable_bypass << 1)    /**< Shifted mode enable_bypass for RAC_PADEBUG0 */
#define RAC_PADEBUG0_TXRREGBYPASS                                     (0x1UL << 2)                                       /**< TXRREGBYPASS                                */
#define _RAC_PADEBUG0_TXRREGBYPASS_SHIFT                              2                                                  /**< Shift value for RAC_TXRREGBYPASS            */
#define _RAC_PADEBUG0_TXRREGBYPASS_MASK                               0x4UL                                              /**< Bit mask for RAC_TXRREGBYPASS               */
#define _RAC_PADEBUG0_TXRREGBYPASS_DEFAULT                            0x00000000UL                                       /**< Mode DEFAULT for RAC_PADEBUG0               */
#define _RAC_PADEBUG0_TXRREGBYPASS_not_bypass                         0x00000000UL                                       /**< Mode not_bypass for RAC_PADEBUG0            */
#define _RAC_PADEBUG0_TXRREGBYPASS_bypass                             0x00000001UL                                       /**< Mode bypass for RAC_PADEBUG0                */
#define RAC_PADEBUG0_TXRREGBYPASS_DEFAULT                             (_RAC_PADEBUG0_TXRREGBYPASS_DEFAULT << 2)          /**< Shifted mode DEFAULT for RAC_PADEBUG0       */
#define RAC_PADEBUG0_TXRREGBYPASS_not_bypass                          (_RAC_PADEBUG0_TXRREGBYPASS_not_bypass << 2)       /**< Shifted mode not_bypass for RAC_PADEBUG0    */
#define RAC_PADEBUG0_TXRREGBYPASS_bypass                              (_RAC_PADEBUG0_TXRREGBYPASS_bypass << 2)           /**< Shifted mode bypass for RAC_PADEBUG0        */
#define RAC_PADEBUG0_TXPDNVDDPA                                       (0x1UL << 3)                                       /**< TXPDNVDDPA                                  */
#define _RAC_PADEBUG0_TXPDNVDDPA_SHIFT                                3                                                  /**< Shift value for RAC_TXPDNVDDPA              */
#define _RAC_PADEBUG0_TXPDNVDDPA_MASK                                 0x8UL                                              /**< Bit mask for RAC_TXPDNVDDPA                 */
#define _RAC_PADEBUG0_TXPDNVDDPA_DEFAULT                              0x00000000UL                                       /**< Mode DEFAULT for RAC_PADEBUG0               */
#define _RAC_PADEBUG0_TXPDNVDDPA_not_pull_down_ovdd                   0x00000000UL                                       /**< Mode not_pull_down_ovdd for RAC_PADEBUG0    */
#define _RAC_PADEBUG0_TXPDNVDDPA_pull_down_ovdd                       0x00000001UL                                       /**< Mode pull_down_ovdd for RAC_PADEBUG0        */
#define RAC_PADEBUG0_TXPDNVDDPA_DEFAULT                               (_RAC_PADEBUG0_TXPDNVDDPA_DEFAULT << 3)            /**< Shifted mode DEFAULT for RAC_PADEBUG0       */
#define RAC_PADEBUG0_TXPDNVDDPA_not_pull_down_ovdd                    (_RAC_PADEBUG0_TXPDNVDDPA_not_pull_down_ovdd << 3) /**< Shifted mode not_pull_down_ovdd for RAC_PADEBUG0*/
#define RAC_PADEBUG0_TXPDNVDDPA_pull_down_ovdd                        (_RAC_PADEBUG0_TXPDNVDDPA_pull_down_ovdd << 3)     /**< Shifted mode pull_down_ovdd for RAC_PADEBUG0*/

