SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/ZGM23/Include/zgm23_rac.h
/* Bit fields for RAC RFPATHEN0 */
#define _RAC_RFPATHEN0_RESETVALUE                                     0x000000C2UL                                        /**< Default value for RAC_RFPATHEN0             */
#define _RAC_RFPATHEN0_MASK                                           0x000000FFUL                                        /**< Mask for RAC_RFPATHEN0                      */
#define RAC_RFPATHEN0_LNAMIXEN0                                       (0x1UL << 0)                                        /**< LNAMIXEN0                                   */
#define _RAC_RFPATHEN0_LNAMIXEN0_SHIFT                                0                                                   /**< Shift value for RAC_LNAMIXEN0               */
#define _RAC_RFPATHEN0_LNAMIXEN0_MASK                                 0x1UL                                               /**< Bit mask for RAC_LNAMIXEN0                  */
#define _RAC_RFPATHEN0_LNAMIXEN0_DEFAULT                              0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN0              */
#define _RAC_RFPATHEN0_LNAMIXEN0_disable                              0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN0              */
#define _RAC_RFPATHEN0_LNAMIXEN0_enable                               0x00000001UL                                        /**< Mode enable for RAC_RFPATHEN0               */
#define RAC_RFPATHEN0_LNAMIXEN0_DEFAULT                               (_RAC_RFPATHEN0_LNAMIXEN0_DEFAULT << 0)             /**< Shifted mode DEFAULT for RAC_RFPATHEN0      */
#define RAC_RFPATHEN0_LNAMIXEN0_disable                               (_RAC_RFPATHEN0_LNAMIXEN0_disable << 0)             /**< Shifted mode disable for RAC_RFPATHEN0      */
#define RAC_RFPATHEN0_LNAMIXEN0_enable                                (_RAC_RFPATHEN0_LNAMIXEN0_enable << 0)              /**< Shifted mode enable for RAC_RFPATHEN0       */
#define RAC_RFPATHEN0_LNAMIXRFATTDCEN0                                (0x1UL << 1)                                        /**< LNAMIXRFATTDCEN0                            */
#define _RAC_RFPATHEN0_LNAMIXRFATTDCEN0_SHIFT                         1                                                   /**< Shift value for RAC_LNAMIXRFATTDCEN0        */
#define _RAC_RFPATHEN0_LNAMIXRFATTDCEN0_MASK                          0x2UL                                               /**< Bit mask for RAC_LNAMIXRFATTDCEN0           */
#define _RAC_RFPATHEN0_LNAMIXRFATTDCEN0_DEFAULT                       0x00000001UL                                        /**< Mode DEFAULT for RAC_RFPATHEN0              */
#define _RAC_RFPATHEN0_LNAMIXRFATTDCEN0_disable_dc                    0x00000000UL                                        /**< Mode disable_dc for RAC_RFPATHEN0           */
#define _RAC_RFPATHEN0_LNAMIXRFATTDCEN0_enable_dc                     0x00000001UL                                        /**< Mode enable_dc for RAC_RFPATHEN0            */
#define RAC_RFPATHEN0_LNAMIXRFATTDCEN0_DEFAULT                        (_RAC_RFPATHEN0_LNAMIXRFATTDCEN0_DEFAULT << 1)      /**< Shifted mode DEFAULT for RAC_RFPATHEN0      */
#define RAC_RFPATHEN0_LNAMIXRFATTDCEN0_disable_dc                     (_RAC_RFPATHEN0_LNAMIXRFATTDCEN0_disable_dc << 1)   /**< Shifted mode disable_dc for RAC_RFPATHEN0   */
#define RAC_RFPATHEN0_LNAMIXRFATTDCEN0_enable_dc                      (_RAC_RFPATHEN0_LNAMIXRFATTDCEN0_enable_dc << 1)    /**< Shifted mode enable_dc for RAC_RFPATHEN0    */
#define RAC_RFPATHEN0_LNAMIXRFPKDENRF0                                (0x1UL << 2)                                        /**< LNAMIXRFPKDENRF0                            */
#define _RAC_RFPATHEN0_LNAMIXRFPKDENRF0_SHIFT                         2                                                   /**< Shift value for RAC_LNAMIXRFPKDENRF0        */
#define _RAC_RFPATHEN0_LNAMIXRFPKDENRF0_MASK                          0x4UL                                               /**< Bit mask for RAC_LNAMIXRFPKDENRF0           */
#define _RAC_RFPATHEN0_LNAMIXRFPKDENRF0_DEFAULT                       0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN0              */
#define _RAC_RFPATHEN0_LNAMIXRFPKDENRF0_disable                       0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN0              */
#define _RAC_RFPATHEN0_LNAMIXRFPKDENRF0_enable_path0                  0x00000001UL                                        /**< Mode enable_path0 for RAC_RFPATHEN0         */
#define RAC_RFPATHEN0_LNAMIXRFPKDENRF0_DEFAULT                        (_RAC_RFPATHEN0_LNAMIXRFPKDENRF0_DEFAULT << 2)      /**< Shifted mode DEFAULT for RAC_RFPATHEN0      */
#define RAC_RFPATHEN0_LNAMIXRFPKDENRF0_disable                        (_RAC_RFPATHEN0_LNAMIXRFPKDENRF0_disable << 2)      /**< Shifted mode disable for RAC_RFPATHEN0      */
#define RAC_RFPATHEN0_LNAMIXRFPKDENRF0_enable_path0                   (_RAC_RFPATHEN0_LNAMIXRFPKDENRF0_enable_path0 << 2) /**< Shifted mode enable_path0 for RAC_RFPATHEN0 */
#define RAC_RFPATHEN0_SYLODIVRLO0SUBGEN                               (0x1UL << 3)                                        /**< SYLODIVRLO0SUBGEN                           */
#define _RAC_RFPATHEN0_SYLODIVRLO0SUBGEN_SHIFT                        3                                                   /**< Shift value for RAC_SYLODIVRLO0SUBGEN       */
#define _RAC_RFPATHEN0_SYLODIVRLO0SUBGEN_MASK                         0x8UL                                               /**< Bit mask for RAC_SYLODIVRLO0SUBGEN          */
#define _RAC_RFPATHEN0_SYLODIVRLO0SUBGEN_DEFAULT                      0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN0              */
#define _RAC_RFPATHEN0_SYLODIVRLO0SUBGEN_disable                      0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN0              */
#define _RAC_RFPATHEN0_SYLODIVRLO0SUBGEN_enable                       0x00000001UL                                        /**< Mode enable for RAC_RFPATHEN0               */
#define RAC_RFPATHEN0_SYLODIVRLO0SUBGEN_DEFAULT                       (_RAC_RFPATHEN0_SYLODIVRLO0SUBGEN_DEFAULT << 3)     /**< Shifted mode DEFAULT for RAC_RFPATHEN0      */
#define RAC_RFPATHEN0_SYLODIVRLO0SUBGEN_disable                       (_RAC_RFPATHEN0_SYLODIVRLO0SUBGEN_disable << 3)     /**< Shifted mode disable for RAC_RFPATHEN0      */
#define RAC_RFPATHEN0_SYLODIVRLO0SUBGEN_enable                        (_RAC_RFPATHEN0_SYLODIVRLO0SUBGEN_enable << 3)      /**< Shifted mode enable for RAC_RFPATHEN0       */
#define RAC_RFPATHEN0_TXENHPA0                                        (0x1UL << 4)                                        /**< TXENHPA0                                    */
#define _RAC_RFPATHEN0_TXENHPA0_SHIFT                                 4                                                   /**< Shift value for RAC_TXENHPA0                */
#define _RAC_RFPATHEN0_TXENHPA0_MASK                                  0x10UL                                              /**< Bit mask for RAC_TXENHPA0                   */
#define _RAC_RFPATHEN0_TXENHPA0_DEFAULT                               0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN0              */
#define _RAC_RFPATHEN0_TXENHPA0_hpa0_off                              0x00000000UL                                        /**< Mode hpa0_off for RAC_RFPATHEN0             */
#define _RAC_RFPATHEN0_TXENHPA0_hpa0_on                               0x00000001UL                                        /**< Mode hpa0_on for RAC_RFPATHEN0              */
#define RAC_RFPATHEN0_TXENHPA0_DEFAULT                                (_RAC_RFPATHEN0_TXENHPA0_DEFAULT << 4)              /**< Shifted mode DEFAULT for RAC_RFPATHEN0      */
#define RAC_RFPATHEN0_TXENHPA0_hpa0_off                               (_RAC_RFPATHEN0_TXENHPA0_hpa0_off << 4)             /**< Shifted mode hpa0_off for RAC_RFPATHEN0     */
#define RAC_RFPATHEN0_TXENHPA0_hpa0_on                                (_RAC_RFPATHEN0_TXENHPA0_hpa0_on << 4)              /**< Shifted mode hpa0_on for RAC_RFPATHEN0      */
#define RAC_RFPATHEN0_TXENLPA0                                        (0x1UL << 5)                                        /**< TXENLPA0                                    */
#define _RAC_RFPATHEN0_TXENLPA0_SHIFT                                 5                                                   /**< Shift value for RAC_TXENLPA0                */
#define _RAC_RFPATHEN0_TXENLPA0_MASK                                  0x20UL                                              /**< Bit mask for RAC_TXENLPA0                   */
#define _RAC_RFPATHEN0_TXENLPA0_DEFAULT                               0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN0              */
#define _RAC_RFPATHEN0_TXENLPA0_lpa0_off                              0x00000000UL                                        /**< Mode lpa0_off for RAC_RFPATHEN0             */
#define _RAC_RFPATHEN0_TXENLPA0_lpa0_on                               0x00000001UL                                        /**< Mode lpa0_on for RAC_RFPATHEN0              */
#define RAC_RFPATHEN0_TXENLPA0_DEFAULT                                (_RAC_RFPATHEN0_TXENLPA0_DEFAULT << 5)              /**< Shifted mode DEFAULT for RAC_RFPATHEN0      */
#define RAC_RFPATHEN0_TXENLPA0_lpa0_off                               (_RAC_RFPATHEN0_TXENLPA0_lpa0_off << 5)             /**< Shifted mode lpa0_off for RAC_RFPATHEN0     */
#define RAC_RFPATHEN0_TXENLPA0_lpa0_on                                (_RAC_RFPATHEN0_TXENLPA0_lpa0_on << 5)              /**< Shifted mode lpa0_on for RAC_RFPATHEN0      */
#define RAC_RFPATHEN0_TXENVMIDHPA0                                    (0x1UL << 6)                                        /**< TXENVMIDHPA0                                */
#define _RAC_RFPATHEN0_TXENVMIDHPA0_SHIFT                             6                                                   /**< Shift value for RAC_TXENVMIDHPA0            */
#define _RAC_RFPATHEN0_TXENVMIDHPA0_MASK                              0x40UL                                              /**< Bit mask for RAC_TXENVMIDHPA0               */
#define _RAC_RFPATHEN0_TXENVMIDHPA0_DEFAULT                           0x00000001UL                                        /**< Mode DEFAULT for RAC_RFPATHEN0              */
#define _RAC_RFPATHEN0_TXENVMIDHPA0_disable                           0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN0              */
#define _RAC_RFPATHEN0_TXENVMIDHPA0_enable                            0x00000001UL                                        /**< Mode enable for RAC_RFPATHEN0               */
#define RAC_RFPATHEN0_TXENVMIDHPA0_DEFAULT                            (_RAC_RFPATHEN0_TXENVMIDHPA0_DEFAULT << 6)          /**< Shifted mode DEFAULT for RAC_RFPATHEN0      */
#define RAC_RFPATHEN0_TXENVMIDHPA0_disable                            (_RAC_RFPATHEN0_TXENVMIDHPA0_disable << 6)          /**< Shifted mode disable for RAC_RFPATHEN0      */
#define RAC_RFPATHEN0_TXENVMIDHPA0_enable                             (_RAC_RFPATHEN0_TXENVMIDHPA0_enable << 6)           /**< Shifted mode enable for RAC_RFPATHEN0       */
#define RAC_RFPATHEN0_TXENVMIDLPA0                                    (0x1UL << 7)                                        /**< TXENVMIDLPA0                                */
#define _RAC_RFPATHEN0_TXENVMIDLPA0_SHIFT                             7                                                   /**< Shift value for RAC_TXENVMIDLPA0            */
#define _RAC_RFPATHEN0_TXENVMIDLPA0_MASK                              0x80UL                                              /**< Bit mask for RAC_TXENVMIDLPA0               */
#define _RAC_RFPATHEN0_TXENVMIDLPA0_DEFAULT                           0x00000001UL                                        /**< Mode DEFAULT for RAC_RFPATHEN0              */
#define _RAC_RFPATHEN0_TXENVMIDLPA0_disable                           0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN0              */
#define _RAC_RFPATHEN0_TXENVMIDLPA0_enable                            0x00000001UL                                        /**< Mode enable for RAC_RFPATHEN0               */
#define RAC_RFPATHEN0_TXENVMIDLPA0_DEFAULT                            (_RAC_RFPATHEN0_TXENVMIDLPA0_DEFAULT << 7)          /**< Shifted mode DEFAULT for RAC_RFPATHEN0      */
#define RAC_RFPATHEN0_TXENVMIDLPA0_disable                            (_RAC_RFPATHEN0_TXENVMIDLPA0_disable << 7)          /**< Shifted mode disable for RAC_RFPATHEN0      */
#define RAC_RFPATHEN0_TXENVMIDLPA0_enable                             (_RAC_RFPATHEN0_TXENVMIDLPA0_enable << 7)           /**< Shifted mode enable for RAC_RFPATHEN0       */

