SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/ZGM23/Include/zgm23_rac.h
/* Bit fields for RAC IFADCPLLDCO */
#define _RAC_IFADCPLLDCO_RESETVALUE                                   0x00010104UL                                           /**< Default value for RAC_IFADCPLLDCO           */
#define _RAC_IFADCPLLDCO_MASK                                         0x0001FFFFUL                                           /**< Mask for RAC_IFADCPLLDCO                    */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOBBCAL_SHIFT                       0                                                      /**< Shift value for RAC_IFADCPLLDCOBBCAL        */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOBBCAL_MASK                        0x7UL                                                  /**< Bit mask for RAC_IFADCPLLDCOBBCAL           */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOBBCAL_DEFAULT                     0x00000004UL                                           /**< Mode DEFAULT for RAC_IFADCPLLDCO            */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOBBCAL_Invalid                     0x00000000UL                                           /**< Mode Invalid for RAC_IFADCPLLDCO            */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOBBCAL_LSB0p5                      0x00000001UL                                           /**< Mode LSB0p5 for RAC_IFADCPLLDCO             */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOBBCAL_LSB1p0                      0x00000002UL                                           /**< Mode LSB1p0 for RAC_IFADCPLLDCO             */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOBBCAL_LSB1p5                      0x00000003UL                                           /**< Mode LSB1p5 for RAC_IFADCPLLDCO             */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOBBCAL_LSB2p0                      0x00000004UL                                           /**< Mode LSB2p0 for RAC_IFADCPLLDCO             */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOBBCAL_LSB2p5                      0x00000005UL                                           /**< Mode LSB2p5 for RAC_IFADCPLLDCO             */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOBBCAL_LSB3p0                      0x00000006UL                                           /**< Mode LSB3p0 for RAC_IFADCPLLDCO             */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOBBCAL_LSB3p5                      0x00000007UL                                           /**< Mode LSB3p5 for RAC_IFADCPLLDCO             */
#define RAC_IFADCPLLDCO_IFADCPLLDCOBBCAL_DEFAULT                      (_RAC_IFADCPLLDCO_IFADCPLLDCOBBCAL_DEFAULT << 0)       /**< Shifted mode DEFAULT for RAC_IFADCPLLDCO    */
#define RAC_IFADCPLLDCO_IFADCPLLDCOBBCAL_Invalid                      (_RAC_IFADCPLLDCO_IFADCPLLDCOBBCAL_Invalid << 0)       /**< Shifted mode Invalid for RAC_IFADCPLLDCO    */
#define RAC_IFADCPLLDCO_IFADCPLLDCOBBCAL_LSB0p5                       (_RAC_IFADCPLLDCO_IFADCPLLDCOBBCAL_LSB0p5 << 0)        /**< Shifted mode LSB0p5 for RAC_IFADCPLLDCO     */
#define RAC_IFADCPLLDCO_IFADCPLLDCOBBCAL_LSB1p0                       (_RAC_IFADCPLLDCO_IFADCPLLDCOBBCAL_LSB1p0 << 0)        /**< Shifted mode LSB1p0 for RAC_IFADCPLLDCO     */
#define RAC_IFADCPLLDCO_IFADCPLLDCOBBCAL_LSB1p5                       (_RAC_IFADCPLLDCO_IFADCPLLDCOBBCAL_LSB1p5 << 0)        /**< Shifted mode LSB1p5 for RAC_IFADCPLLDCO     */
#define RAC_IFADCPLLDCO_IFADCPLLDCOBBCAL_LSB2p0                       (_RAC_IFADCPLLDCO_IFADCPLLDCOBBCAL_LSB2p0 << 0)        /**< Shifted mode LSB2p0 for RAC_IFADCPLLDCO     */
#define RAC_IFADCPLLDCO_IFADCPLLDCOBBCAL_LSB2p5                       (_RAC_IFADCPLLDCO_IFADCPLLDCOBBCAL_LSB2p5 << 0)        /**< Shifted mode LSB2p5 for RAC_IFADCPLLDCO     */
#define RAC_IFADCPLLDCO_IFADCPLLDCOBBCAL_LSB3p0                       (_RAC_IFADCPLLDCO_IFADCPLLDCOBBCAL_LSB3p0 << 0)        /**< Shifted mode LSB3p0 for RAC_IFADCPLLDCO     */
#define RAC_IFADCPLLDCO_IFADCPLLDCOBBCAL_LSB3p5                       (_RAC_IFADCPLLDCO_IFADCPLLDCOBBCAL_LSB3p5 << 0)        /**< Shifted mode LSB3p5 for RAC_IFADCPLLDCO     */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOTEMPADJ_SHIFT                     3                                                      /**< Shift value for RAC_IFADCPLLDCOTEMPADJ      */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOTEMPADJ_MASK                      0x1F8UL                                                /**< Bit mask for RAC_IFADCPLLDCOTEMPADJ         */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOTEMPADJ_DEFAULT                   0x00000020UL                                           /**< Mode DEFAULT for RAC_IFADCPLLDCO            */
#define RAC_IFADCPLLDCO_IFADCPLLDCOTEMPADJ_DEFAULT                    (_RAC_IFADCPLLDCO_IFADCPLLDCOTEMPADJ_DEFAULT << 3)     /**< Shifted mode DEFAULT for RAC_IFADCPLLDCO    */
#define RAC_IFADCPLLDCO_IFADCPLLDCOBIASHALF                           (0x1UL << 9)                                           /**< IFADCPLLDCOBIASHALF                         */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOBIASHALF_SHIFT                    9                                                      /**< Shift value for RAC_IFADCPLLDCOBIASHALF     */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOBIASHALF_MASK                     0x200UL                                                /**< Bit mask for RAC_IFADCPLLDCOBIASHALF        */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOBIASHALF_DEFAULT                  0x00000000UL                                           /**< Mode DEFAULT for RAC_IFADCPLLDCO            */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOBIASHALF_disable                  0x00000000UL                                           /**< Mode disable for RAC_IFADCPLLDCO            */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOBIASHALF_enable                   0x00000001UL                                           /**< Mode enable for RAC_IFADCPLLDCO             */
#define RAC_IFADCPLLDCO_IFADCPLLDCOBIASHALF_DEFAULT                   (_RAC_IFADCPLLDCO_IFADCPLLDCOBIASHALF_DEFAULT << 9)    /**< Shifted mode DEFAULT for RAC_IFADCPLLDCO    */
#define RAC_IFADCPLLDCO_IFADCPLLDCOBIASHALF_disable                   (_RAC_IFADCPLLDCO_IFADCPLLDCOBIASHALF_disable << 9)    /**< Shifted mode disable for RAC_IFADCPLLDCO    */
#define RAC_IFADCPLLDCO_IFADCPLLDCOBIASHALF_enable                    (_RAC_IFADCPLLDCO_IFADCPLLDCOBIASHALF_enable << 9)     /**< Shifted mode enable for RAC_IFADCPLLDCO     */
#define RAC_IFADCPLLDCO_IFADCPLLDCOENABLE                             (0x1UL << 10)                                          /**< IFADCPLLDCOENABLE                           */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOENABLE_SHIFT                      10                                                     /**< Shift value for RAC_IFADCPLLDCOENABLE       */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOENABLE_MASK                       0x400UL                                                /**< Bit mask for RAC_IFADCPLLDCOENABLE          */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOENABLE_DEFAULT                    0x00000000UL                                           /**< Mode DEFAULT for RAC_IFADCPLLDCO            */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOENABLE_disable                    0x00000000UL                                           /**< Mode disable for RAC_IFADCPLLDCO            */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOENABLE_enable                     0x00000001UL                                           /**< Mode enable for RAC_IFADCPLLDCO             */
#define RAC_IFADCPLLDCO_IFADCPLLDCOENABLE_DEFAULT                     (_RAC_IFADCPLLDCO_IFADCPLLDCOENABLE_DEFAULT << 10)     /**< Shifted mode DEFAULT for RAC_IFADCPLLDCO    */
#define RAC_IFADCPLLDCO_IFADCPLLDCOENABLE_disable                     (_RAC_IFADCPLLDCO_IFADCPLLDCOENABLE_disable << 10)     /**< Shifted mode disable for RAC_IFADCPLLDCO    */
#define RAC_IFADCPLLDCO_IFADCPLLDCOENABLE_enable                      (_RAC_IFADCPLLDCO_IFADCPLLDCOENABLE_enable << 10)      /**< Shifted mode enable for RAC_IFADCPLLDCO     */
#define RAC_IFADCPLLDCO_IFADCPLLDCOFILTER                             (0x1UL << 11)                                          /**< IFADCPLLDCOFILTER                           */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOFILTER_SHIFT                      11                                                     /**< Shift value for RAC_IFADCPLLDCOFILTER       */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOFILTER_MASK                       0x800UL                                                /**< Bit mask for RAC_IFADCPLLDCOFILTER          */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOFILTER_DEFAULT                    0x00000000UL                                           /**< Mode DEFAULT for RAC_IFADCPLLDCO            */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOFILTER_disable                    0x00000000UL                                           /**< Mode disable for RAC_IFADCPLLDCO            */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOFILTER_enable                     0x00000001UL                                           /**< Mode enable for RAC_IFADCPLLDCO             */
#define RAC_IFADCPLLDCO_IFADCPLLDCOFILTER_DEFAULT                     (_RAC_IFADCPLLDCO_IFADCPLLDCOFILTER_DEFAULT << 11)     /**< Shifted mode DEFAULT for RAC_IFADCPLLDCO    */
#define RAC_IFADCPLLDCO_IFADCPLLDCOFILTER_disable                     (_RAC_IFADCPLLDCO_IFADCPLLDCOFILTER_disable << 11)     /**< Shifted mode disable for RAC_IFADCPLLDCO    */
#define RAC_IFADCPLLDCO_IFADCPLLDCOFILTER_enable                      (_RAC_IFADCPLLDCO_IFADCPLLDCOFILTER_enable << 11)      /**< Shifted mode enable for RAC_IFADCPLLDCO     */
#define RAC_IFADCPLLDCO_IFADCPLLDCOFULLRATE                           (0x1UL << 12)                                          /**< IFADCPLLDCOFULLRATE                         */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOFULLRATE_SHIFT                    12                                                     /**< Shift value for RAC_IFADCPLLDCOFULLRATE     */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOFULLRATE_MASK                     0x1000UL                                               /**< Bit mask for RAC_IFADCPLLDCOFULLRATE        */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOFULLRATE_DEFAULT                  0x00000000UL                                           /**< Mode DEFAULT for RAC_IFADCPLLDCO            */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOFULLRATE_halfrate                 0x00000000UL                                           /**< Mode halfrate for RAC_IFADCPLLDCO           */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOFULLRATE_fullrate                 0x00000001UL                                           /**< Mode fullrate for RAC_IFADCPLLDCO           */
#define RAC_IFADCPLLDCO_IFADCPLLDCOFULLRATE_DEFAULT                   (_RAC_IFADCPLLDCO_IFADCPLLDCOFULLRATE_DEFAULT << 12)   /**< Shifted mode DEFAULT for RAC_IFADCPLLDCO    */
#define RAC_IFADCPLLDCO_IFADCPLLDCOFULLRATE_halfrate                  (_RAC_IFADCPLLDCO_IFADCPLLDCOFULLRATE_halfrate << 12)  /**< Shifted mode halfrate for RAC_IFADCPLLDCO   */
#define RAC_IFADCPLLDCO_IFADCPLLDCOFULLRATE_fullrate                  (_RAC_IFADCPLLDCO_IFADCPLLDCOFULLRATE_fullrate << 12)  /**< Shifted mode fullrate for RAC_IFADCPLLDCO   */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOMSBCURRENT_SHIFT                  13                                                     /**< Shift value for RAC_IFADCPLLDCOMSBCURRENT   */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOMSBCURRENT_MASK                   0x1E000UL                                              /**< Bit mask for RAC_IFADCPLLDCOMSBCURRENT      */
#define _RAC_IFADCPLLDCO_IFADCPLLDCOMSBCURRENT_DEFAULT                0x00000008UL                                           /**< Mode DEFAULT for RAC_IFADCPLLDCO            */
#define RAC_IFADCPLLDCO_IFADCPLLDCOMSBCURRENT_DEFAULT                 (_RAC_IFADCPLLDCO_IFADCPLLDCOMSBCURRENT_DEFAULT << 13) /**< Shifted mode DEFAULT for RAC_IFADCPLLDCO    */

