SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/ZGM23/Include/zgm23_rac.h
/* Bit fields for RAC IFADCPLLEN */
#define _RAC_IFADCPLLEN_RESETVALUE                                    0x00000000UL                                          /**< Default value for RAC_IFADCPLLEN            */
#define _RAC_IFADCPLLEN_MASK                                          0x000003FDUL                                          /**< Mask for RAC_IFADCPLLEN                     */
#define RAC_IFADCPLLEN_IFADCPLLENBBDET                                (0x1UL << 0)                                          /**< IFADCPLLENBBDET                             */
#define _RAC_IFADCPLLEN_IFADCPLLENBBDET_SHIFT                         0                                                     /**< Shift value for RAC_IFADCPLLENBBDET         */
#define _RAC_IFADCPLLEN_IFADCPLLENBBDET_MASK                          0x1UL                                                 /**< Bit mask for RAC_IFADCPLLENBBDET            */
#define _RAC_IFADCPLLEN_IFADCPLLENBBDET_DEFAULT                       0x00000000UL                                          /**< Mode DEFAULT for RAC_IFADCPLLEN             */
#define _RAC_IFADCPLLEN_IFADCPLLENBBDET_disable                       0x00000000UL                                          /**< Mode disable for RAC_IFADCPLLEN             */
#define _RAC_IFADCPLLEN_IFADCPLLENBBDET_enable                        0x00000001UL                                          /**< Mode enable for RAC_IFADCPLLEN              */
#define RAC_IFADCPLLEN_IFADCPLLENBBDET_DEFAULT                        (_RAC_IFADCPLLEN_IFADCPLLENBBDET_DEFAULT << 0)        /**< Shifted mode DEFAULT for RAC_IFADCPLLEN     */
#define RAC_IFADCPLLEN_IFADCPLLENBBDET_disable                        (_RAC_IFADCPLLEN_IFADCPLLENBBDET_disable << 0)        /**< Shifted mode disable for RAC_IFADCPLLEN     */
#define RAC_IFADCPLLEN_IFADCPLLENBBDET_enable                         (_RAC_IFADCPLLEN_IFADCPLLENBBDET_enable << 0)         /**< Shifted mode enable for RAC_IFADCPLLEN      */
#define RAC_IFADCPLLEN_IFADCPLLENBBXLDET                              (0x1UL << 2)                                          /**< IFADCPLLENBBXLDET                           */
#define _RAC_IFADCPLLEN_IFADCPLLENBBXLDET_SHIFT                       2                                                     /**< Shift value for RAC_IFADCPLLENBBXLDET       */
#define _RAC_IFADCPLLEN_IFADCPLLENBBXLDET_MASK                        0x4UL                                                 /**< Bit mask for RAC_IFADCPLLENBBXLDET          */
#define _RAC_IFADCPLLEN_IFADCPLLENBBXLDET_DEFAULT                     0x00000000UL                                          /**< Mode DEFAULT for RAC_IFADCPLLEN             */
#define _RAC_IFADCPLLEN_IFADCPLLENBBXLDET_disable                     0x00000000UL                                          /**< Mode disable for RAC_IFADCPLLEN             */
#define _RAC_IFADCPLLEN_IFADCPLLENBBXLDET_enable                      0x00000001UL                                          /**< Mode enable for RAC_IFADCPLLEN              */
#define RAC_IFADCPLLEN_IFADCPLLENBBXLDET_DEFAULT                      (_RAC_IFADCPLLEN_IFADCPLLENBBXLDET_DEFAULT << 2)      /**< Shifted mode DEFAULT for RAC_IFADCPLLEN     */
#define RAC_IFADCPLLEN_IFADCPLLENBBXLDET_disable                      (_RAC_IFADCPLLEN_IFADCPLLENBBXLDET_disable << 2)      /**< Shifted mode disable for RAC_IFADCPLLEN     */
#define RAC_IFADCPLLEN_IFADCPLLENBBXLDET_enable                       (_RAC_IFADCPLLEN_IFADCPLLENBBXLDET_enable << 2)       /**< Shifted mode enable for RAC_IFADCPLLEN      */
#define RAC_IFADCPLLEN_IFADCPLLENBBXMDET                              (0x1UL << 3)                                          /**< IFADCPLLENBBXMDET                           */
#define _RAC_IFADCPLLEN_IFADCPLLENBBXMDET_SHIFT                       3                                                     /**< Shift value for RAC_IFADCPLLENBBXMDET       */
#define _RAC_IFADCPLLEN_IFADCPLLENBBXMDET_MASK                        0x8UL                                                 /**< Bit mask for RAC_IFADCPLLENBBXMDET          */
#define _RAC_IFADCPLLEN_IFADCPLLENBBXMDET_DEFAULT                     0x00000000UL                                          /**< Mode DEFAULT for RAC_IFADCPLLEN             */
#define _RAC_IFADCPLLEN_IFADCPLLENBBXMDET_disable                     0x00000000UL                                          /**< Mode disable for RAC_IFADCPLLEN             */
#define _RAC_IFADCPLLEN_IFADCPLLENBBXMDET_enable                      0x00000001UL                                          /**< Mode enable for RAC_IFADCPLLEN              */
#define RAC_IFADCPLLEN_IFADCPLLENBBXMDET_DEFAULT                      (_RAC_IFADCPLLEN_IFADCPLLENBBXMDET_DEFAULT << 3)      /**< Shifted mode DEFAULT for RAC_IFADCPLLEN     */
#define RAC_IFADCPLLEN_IFADCPLLENBBXMDET_disable                      (_RAC_IFADCPLLEN_IFADCPLLENBBXMDET_disable << 3)      /**< Shifted mode disable for RAC_IFADCPLLEN     */
#define RAC_IFADCPLLEN_IFADCPLLENBBXMDET_enable                       (_RAC_IFADCPLLEN_IFADCPLLENBBXMDET_enable << 3)       /**< Shifted mode enable for RAC_IFADCPLLEN      */
#define RAC_IFADCPLLEN_IFADCPLLENCFDET                                (0x1UL << 4)                                          /**< IFADCPLLENCFDET                             */
#define _RAC_IFADCPLLEN_IFADCPLLENCFDET_SHIFT                         4                                                     /**< Shift value for RAC_IFADCPLLENCFDET         */
#define _RAC_IFADCPLLEN_IFADCPLLENCFDET_MASK                          0x10UL                                                /**< Bit mask for RAC_IFADCPLLENCFDET            */
#define _RAC_IFADCPLLEN_IFADCPLLENCFDET_DEFAULT                       0x00000000UL                                          /**< Mode DEFAULT for RAC_IFADCPLLEN             */
#define _RAC_IFADCPLLEN_IFADCPLLENCFDET_disable                       0x00000000UL                                          /**< Mode disable for RAC_IFADCPLLEN             */
#define _RAC_IFADCPLLEN_IFADCPLLENCFDET_enable                        0x00000001UL                                          /**< Mode enable for RAC_IFADCPLLEN              */
#define RAC_IFADCPLLEN_IFADCPLLENCFDET_DEFAULT                        (_RAC_IFADCPLLEN_IFADCPLLENCFDET_DEFAULT << 4)        /**< Shifted mode DEFAULT for RAC_IFADCPLLEN     */
#define RAC_IFADCPLLEN_IFADCPLLENCFDET_disable                        (_RAC_IFADCPLLEN_IFADCPLLENCFDET_disable << 4)        /**< Shifted mode disable for RAC_IFADCPLLEN     */
#define RAC_IFADCPLLEN_IFADCPLLENCFDET_enable                         (_RAC_IFADCPLLEN_IFADCPLLENCFDET_enable << 4)         /**< Shifted mode enable for RAC_IFADCPLLEN      */
#define RAC_IFADCPLLEN_IFADCPLLENROTDET                               (0x1UL << 5)                                          /**< IFADCPLLENROTDET                            */
#define _RAC_IFADCPLLEN_IFADCPLLENROTDET_SHIFT                        5                                                     /**< Shift value for RAC_IFADCPLLENROTDET        */
#define _RAC_IFADCPLLEN_IFADCPLLENROTDET_MASK                         0x20UL                                                /**< Bit mask for RAC_IFADCPLLENROTDET           */
#define _RAC_IFADCPLLEN_IFADCPLLENROTDET_DEFAULT                      0x00000000UL                                          /**< Mode DEFAULT for RAC_IFADCPLLEN             */
#define _RAC_IFADCPLLEN_IFADCPLLENROTDET_disable                      0x00000000UL                                          /**< Mode disable for RAC_IFADCPLLEN             */
#define _RAC_IFADCPLLEN_IFADCPLLENROTDET_enable                       0x00000001UL                                          /**< Mode enable for RAC_IFADCPLLEN              */
#define RAC_IFADCPLLEN_IFADCPLLENROTDET_DEFAULT                       (_RAC_IFADCPLLEN_IFADCPLLENROTDET_DEFAULT << 5)       /**< Shifted mode DEFAULT for RAC_IFADCPLLEN     */
#define RAC_IFADCPLLEN_IFADCPLLENROTDET_disable                       (_RAC_IFADCPLLEN_IFADCPLLENROTDET_disable << 5)       /**< Shifted mode disable for RAC_IFADCPLLEN     */
#define RAC_IFADCPLLEN_IFADCPLLENROTDET_enable                        (_RAC_IFADCPLLEN_IFADCPLLENROTDET_enable << 5)        /**< Shifted mode enable for RAC_IFADCPLLEN      */
#define RAC_IFADCPLLEN_IFADCPLLSERIEREGENABLE                         (0x1UL << 6)                                          /**< IFADCPLLSERIEREGENABLE                      */
#define _RAC_IFADCPLLEN_IFADCPLLSERIEREGENABLE_SHIFT                  6                                                     /**< Shift value for RAC_IFADCPLLSERIEREGENABLE  */
#define _RAC_IFADCPLLEN_IFADCPLLSERIEREGENABLE_MASK                   0x40UL                                                /**< Bit mask for RAC_IFADCPLLSERIEREGENABLE     */
#define _RAC_IFADCPLLEN_IFADCPLLSERIEREGENABLE_DEFAULT                0x00000000UL                                          /**< Mode DEFAULT for RAC_IFADCPLLEN             */
#define _RAC_IFADCPLLEN_IFADCPLLSERIEREGENABLE_disable                0x00000000UL                                          /**< Mode disable for RAC_IFADCPLLEN             */
#define _RAC_IFADCPLLEN_IFADCPLLSERIEREGENABLE_enable                 0x00000001UL                                          /**< Mode enable for RAC_IFADCPLLEN              */
#define RAC_IFADCPLLEN_IFADCPLLSERIEREGENABLE_DEFAULT                 (_RAC_IFADCPLLEN_IFADCPLLSERIEREGENABLE_DEFAULT << 6) /**< Shifted mode DEFAULT for RAC_IFADCPLLEN     */
#define RAC_IFADCPLLEN_IFADCPLLSERIEREGENABLE_disable                 (_RAC_IFADCPLLEN_IFADCPLLSERIEREGENABLE_disable << 6) /**< Shifted mode disable for RAC_IFADCPLLEN     */
#define RAC_IFADCPLLEN_IFADCPLLSERIEREGENABLE_enable                  (_RAC_IFADCPLLEN_IFADCPLLSERIEREGENABLE_enable << 6)  /**< Shifted mode enable for RAC_IFADCPLLEN      */
#define RAC_IFADCPLLEN_IFADCPLLSHUNTREGENABLE                         (0x1UL << 7)                                          /**< IFADCPLLSHUNTREGENABLE                      */
#define _RAC_IFADCPLLEN_IFADCPLLSHUNTREGENABLE_SHIFT                  7                                                     /**< Shift value for RAC_IFADCPLLSHUNTREGENABLE  */
#define _RAC_IFADCPLLEN_IFADCPLLSHUNTREGENABLE_MASK                   0x80UL                                                /**< Bit mask for RAC_IFADCPLLSHUNTREGENABLE     */
#define _RAC_IFADCPLLEN_IFADCPLLSHUNTREGENABLE_DEFAULT                0x00000000UL                                          /**< Mode DEFAULT for RAC_IFADCPLLEN             */
#define _RAC_IFADCPLLEN_IFADCPLLSHUNTREGENABLE_disable                0x00000000UL                                          /**< Mode disable for RAC_IFADCPLLEN             */
#define _RAC_IFADCPLLEN_IFADCPLLSHUNTREGENABLE_enable                 0x00000001UL                                          /**< Mode enable for RAC_IFADCPLLEN              */
#define RAC_IFADCPLLEN_IFADCPLLSHUNTREGENABLE_DEFAULT                 (_RAC_IFADCPLLEN_IFADCPLLSHUNTREGENABLE_DEFAULT << 7) /**< Shifted mode DEFAULT for RAC_IFADCPLLEN     */
#define RAC_IFADCPLLEN_IFADCPLLSHUNTREGENABLE_disable                 (_RAC_IFADCPLLEN_IFADCPLLSHUNTREGENABLE_disable << 7) /**< Shifted mode disable for RAC_IFADCPLLEN     */
#define RAC_IFADCPLLEN_IFADCPLLSHUNTREGENABLE_enable                  (_RAC_IFADCPLLEN_IFADCPLLSHUNTREGENABLE_enable << 7)  /**< Shifted mode enable for RAC_IFADCPLLEN      */
#define RAC_IFADCPLLEN_IFADCPLLENREFBUF                               (0x1UL << 8)                                          /**< IFADCPLLENREFBUF                            */
#define _RAC_IFADCPLLEN_IFADCPLLENREFBUF_SHIFT                        8                                                     /**< Shift value for RAC_IFADCPLLENREFBUF        */
#define _RAC_IFADCPLLEN_IFADCPLLENREFBUF_MASK                         0x100UL                                               /**< Bit mask for RAC_IFADCPLLENREFBUF           */
#define _RAC_IFADCPLLEN_IFADCPLLENREFBUF_DEFAULT                      0x00000000UL                                          /**< Mode DEFAULT for RAC_IFADCPLLEN             */
#define _RAC_IFADCPLLEN_IFADCPLLENREFBUF_disable                      0x00000000UL                                          /**< Mode disable for RAC_IFADCPLLEN             */
#define _RAC_IFADCPLLEN_IFADCPLLENREFBUF_enable                       0x00000001UL                                          /**< Mode enable for RAC_IFADCPLLEN              */
#define RAC_IFADCPLLEN_IFADCPLLENREFBUF_DEFAULT                       (_RAC_IFADCPLLEN_IFADCPLLENREFBUF_DEFAULT << 8)       /**< Shifted mode DEFAULT for RAC_IFADCPLLEN     */
#define RAC_IFADCPLLEN_IFADCPLLENREFBUF_disable                       (_RAC_IFADCPLLEN_IFADCPLLENREFBUF_disable << 8)       /**< Shifted mode disable for RAC_IFADCPLLEN     */
#define RAC_IFADCPLLEN_IFADCPLLENREFBUF_enable                        (_RAC_IFADCPLLEN_IFADCPLLENREFBUF_enable << 8)        /**< Shifted mode enable for RAC_IFADCPLLEN      */
#define RAC_IFADCPLLEN_IFADCPLLENXOBYP                                (0x1UL << 9)                                          /**< IFADCPLLENXOBYP                             */
#define _RAC_IFADCPLLEN_IFADCPLLENXOBYP_SHIFT                         9                                                     /**< Shift value for RAC_IFADCPLLENXOBYP         */
#define _RAC_IFADCPLLEN_IFADCPLLENXOBYP_MASK                          0x200UL                                               /**< Bit mask for RAC_IFADCPLLENXOBYP            */
#define _RAC_IFADCPLLEN_IFADCPLLENXOBYP_DEFAULT                       0x00000000UL                                          /**< Mode DEFAULT for RAC_IFADCPLLEN             */
#define _RAC_IFADCPLLEN_IFADCPLLENXOBYP_disable                       0x00000000UL                                          /**< Mode disable for RAC_IFADCPLLEN             */
#define _RAC_IFADCPLLEN_IFADCPLLENXOBYP_enable                        0x00000001UL                                          /**< Mode enable for RAC_IFADCPLLEN              */
#define RAC_IFADCPLLEN_IFADCPLLENXOBYP_DEFAULT                        (_RAC_IFADCPLLEN_IFADCPLLENXOBYP_DEFAULT << 9)        /**< Shifted mode DEFAULT for RAC_IFADCPLLEN     */
#define RAC_IFADCPLLEN_IFADCPLLENXOBYP_disable                        (_RAC_IFADCPLLEN_IFADCPLLENXOBYP_disable << 9)        /**< Shifted mode disable for RAC_IFADCPLLEN     */
#define RAC_IFADCPLLEN_IFADCPLLENXOBYP_enable                         (_RAC_IFADCPLLEN_IFADCPLLENXOBYP_enable << 9)         /**< Shifted mode enable for RAC_IFADCPLLEN      */

